QTL_mapping.org
#+TITLE: QTL mapping for spine length in JAMA x PAXB cross
#+AUTHOR: Tim Howes
#+OPTIONS: num:nil ^:nil f:nil toc:t
#+OPTIONS: author:t creator:t
#+STARTUP: showall indent
#+PROPERTY: header-args :results silent :exports both :eval no-export
#+PROPERTY: header-args:R :results none :exports both :session *R*

-----

* QTL mapping in Family 4 across all linkage groups

