QTL_mapping.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-27 Thu 20:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QTL mapping for spine length in JAMA x PAXB cross</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tim Howes" />
</head>
<body>
<div id="content">
<h1 class="title">QTL mapping for spine length in JAMA x PAXB cross</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org541cc31">QTL mapping in Family 4 across all linkage groups</a>
<ul>
<li><a href="#org360457b">Load Family 4 genotypes and clean up data</a></li>
<li><a href="#orgb96bca8">Build linkage map using Family 4 genotype data</a></li>
<li><a href="#orge06a6eb">QTL analysis of Family 4 as outbred cross</a></li>
</ul>
</li>
<li><a href="#orge34ceca">Fine mapping across all families for chromosome 4 region of interest</a></li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-org541cc31" class="outline-2">
<h2 id="org541cc31">QTL mapping in Family 4 across all linkage groups</h2>
