QTL_mapping.org
** Load Family 4 genotypes and clean up data

#+begin_src R

  ## Load colleced genotype data for Family 4
  fam4.geno <- read.csv("data/fam4.geno.initial.csv", stringsAsFactors = FALSE)


  ## Check segregation ratios of aa, ab, bb genotypes
  seg.types <- rep("<abxcd>", dim(fam4.geno)[2]-1)
  for(j in 2:dim(fam4.geno)[2]){
      x <- table(unlist( fam4.geno[,j] ), useNA="always")
      if( length(x) < 5 ){
          print(x)
          print(names(fam4.geno)[j])
      }
      if( names(x)[1]=="aa" ){
          seg.types[j-1] <- "<abxab>"
      }
  }
  ## these markers should be aa x ab
  seg.types[match(c("Stn2", "marker2", "Stn32", "Stn75", "Stn300", "Stn285",
                    "Stn114", "Stn310", "Stn318", "Stn236", "Stn169", "Stn168",
                    "Stn233", "Stn291", "Stn178", "Stn188", "Idh", "Stn273"),
                  names(fam4.geno)[-1])] <- "<aaxab>"
  ## these markers should be ab x aa
  seg.types[match(c("Stn293", "Stn330", "Stn242", "Stn12", "Stn17", "Stn328",
                    "Stn33", "Stn312", "Stn85", "Stn95", "Stn107", "Stn320",
                    "Stn134", "Gac1116", "Stn255", "Stn331", "Stn179", "Stn263"),
                  names(fam4.geno)[-1])] <- "<abxaa>"

  ## missing ac: Stn271, Stn187, Stn274, Stn192, Stn284, Stn256
  ## missing bd: Stn313, Stn193 (but only 5 ad)
  ## missing ac, bc (ab x dd): Stn72, Stn191
  seg.types[match(c("Stn72", "Stn191"), names(fam4.geno[-1]))] <- "<abxdd>"
  ## missing bc (and only 2 ac, maybe ab x dd): Stn104
  ## missing bc, bd (aa x cd): Stn295, Stn308
  seg.types[match(c("Stn295", "Stn308"), names(fam4.geno[-1]))] <- "<aaxcd>"
  ## missing ad, bd (ab x cc): Stn202, Stn105
  seg.types[match(c("Stn202", "Stn105"), names(fam4.geno[-1]))] <- "<abxcc>"
  ## only 1 ac and 1 bc (maybe ab x dd): Stn186
  table(unlist( fam4.geno[,match("Stn186", names(fam4.geno))] ))
  ## only 1 bc: Stn298
  table(unlist( fam4.geno[,match("Stn298", names(fam4.geno))] ))
  ## only 1 bd (should be ab x ab): EaagMcac1
  table(unlist( fam4.geno[,match("EaagMcac1", names(fam4.geno))] ))
  fam4.geno$EaagMcac1[ fam4.geno$EaagMcac1 == "bd" ] <- NA
  seg.types[match("EaagMcac1", names(fam4.geno[-1]))] <- "<abxab>"


  ## Remove markers that had high error rates in the linkage map
  x <- match(c("Stn114", "Stn286", "Gac2111", "Stn24", "Stn71", "Stn118", "Stn232",
               "Stn138", "Stn196", "Stn114", "Stn21", "Stn277"), names(fam4.geno))
  fam4.geno <- fam4.geno[, -x]
  seg.types <- seg.types[ -(x-1) ]

  ## Remove markers that have identical positions to other markers
  x <- match(c("Stn265", "Hoxc95.", "Hoxc9F2.R2", "Stn152", "Stn267", "Stn176",
               "Stn191", "Stn284", "Stn193", "Stn188", "Stn274", "hoxabce1",
               "Hoxa10b", "cm488", "marker1", "Stn285", "Stn99", "Stn106",
               "Stn225", "Stn278", "Stn139", "Stn142", "Stn295", "cm820.821",
               "H9green1pel", "F10blue5.pel", "Stn78", "Stn246", "Stn276",
               "Stn155", "Stn7", "Stn321"), names(fam4.geno))
  fam4.geno <- fam4.geno[, -x]
  seg.types <- seg.types[ -(x-1) ]

  ## 375 fish, 244 markers
  ## Stn133 is dropped later during linkage map construction

  ## Output Family 4 genotypes for building linkage map based on outbred (4-way) data
  table(seg.types)
  table(unlist(fam4.geno[,-1]), useNA="always")
  fam4.geno$Fish <- paste0("4-", fam4.geno$Fish)
  fam4.geno[ is.na(fam4.geno) ] <- "--"
  write.csv(fam4.geno, "data/fam4.geno.csv", row.names=FALSE)
  x <- "linkage_map/tmap_genotypes_fam4_outbred.txt"
  write.table("data type outbred", x, col.names=FALSE, row.names=FALSE, quote=FALSE)
  write.table(paste(dim(fam4.geno)[1], dim(fam4.geno)[2]-1, collapse=" "), x, append=TRUE, col.names=FALSE,
              row.names=FALSE, quote=FALSE)
  write.table(cbind(as.vector(names(fam4.geno)[2:dim(fam4.geno)[2]]), seg.types,
                    t(fam4.geno[,2:dim(fam4.geno)[2]])), x, quote=FALSE, sep="\t",append=TRUE,
              col.names=FALSE, row.names=FALSE)
#+end_src


