QTL_mapping.html
<div class="outline-text-2" id="text-org541cc31">
</div><div id="outline-container-org360457b" class="outline-3">
<h3 id="org360457b">Load Family 4 genotypes and clean up data</h3>
<div class="outline-text-3" id="text-org360457b">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #204A87;">## </span><span style="color: #204A87;">Load colleced genotype data for Family 4</span>
fam4.geno <span style="color: #F5666D;">&lt;-</span> read.csv(<span style="color: #4E9A06;">"data/fam4.geno.initial.csv"</span>, stringsAsFactors = <span style="color: #2F8B58; font-weight: bold;">FALSE</span>)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Check segregation ratios of aa, ab, bb genotypes</span>
seg.types <span style="color: #F5666D;">&lt;-</span> rep(<span style="color: #4E9A06;">"&lt;abxcd&gt;"</span>, dim(fam4.geno)[2]-1)
<span style="color: #A52A2A; font-weight: bold;">for</span>(j <span style="color: #A52A2A; font-weight: bold;">in</span> 2:dim(fam4.geno)[2]){
    x <span style="color: #F5666D;">&lt;-</span> table(unlist( fam4.geno[,j] ), useNA=<span style="color: #4E9A06;">"always"</span>)
    <span style="color: #A52A2A; font-weight: bold;">if</span>( length(x) &lt; 5 ){
        print(x)
        print(names(fam4.geno)[j])
    }
    <span style="color: #A52A2A; font-weight: bold;">if</span>( names(x)[1]==<span style="color: #4E9A06;">"aa"</span> ){
        seg.types[j-1] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"&lt;abxab&gt;"</span>
    }
}
<span style="color: #204A87;">## </span><span style="color: #204A87;">these markers should be aa x ab</span>
seg.types[match(c(<span style="color: #4E9A06;">"Stn2"</span>, <span style="color: #4E9A06;">"marker2"</span>, <span style="color: #4E9A06;">"Stn32"</span>, <span style="color: #4E9A06;">"Stn75"</span>, <span style="color: #4E9A06;">"Stn300"</span>, <span style="color: #4E9A06;">"Stn285"</span>,
                  <span style="color: #4E9A06;">"Stn114"</span>, <span style="color: #4E9A06;">"Stn310"</span>, <span style="color: #4E9A06;">"Stn318"</span>, <span style="color: #4E9A06;">"Stn236"</span>, <span style="color: #4E9A06;">"Stn169"</span>, <span style="color: #4E9A06;">"Stn168"</span>,
                  <span style="color: #4E9A06;">"Stn233"</span>, <span style="color: #4E9A06;">"Stn291"</span>, <span style="color: #4E9A06;">"Stn178"</span>, <span style="color: #4E9A06;">"Stn188"</span>, <span style="color: #4E9A06;">"Idh"</span>, <span style="color: #4E9A06;">"Stn273"</span>),
                names(fam4.geno)[-1])] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"&lt;aaxab&gt;"</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">these markers should be ab x aa</span>
seg.types[match(c(<span style="color: #4E9A06;">"Stn293"</span>, <span style="color: #4E9A06;">"Stn330"</span>, <span style="color: #4E9A06;">"Stn242"</span>, <span style="color: #4E9A06;">"Stn12"</span>, <span style="color: #4E9A06;">"Stn17"</span>, <span style="color: #4E9A06;">"Stn328"</span>,
                  <span style="color: #4E9A06;">"Stn33"</span>, <span style="color: #4E9A06;">"Stn312"</span>, <span style="color: #4E9A06;">"Stn85"</span>, <span style="color: #4E9A06;">"Stn95"</span>, <span style="color: #4E9A06;">"Stn107"</span>, <span style="color: #4E9A06;">"Stn320"</span>,
                  <span style="color: #4E9A06;">"Stn134"</span>, <span style="color: #4E9A06;">"Gac1116"</span>, <span style="color: #4E9A06;">"Stn255"</span>, <span style="color: #4E9A06;">"Stn331"</span>, <span style="color: #4E9A06;">"Stn179"</span>, <span style="color: #4E9A06;">"Stn263"</span>),
                names(fam4.geno)[-1])] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"&lt;abxaa&gt;"</span>

<span style="color: #204A87;">## </span><span style="color: #204A87;">missing ac: Stn271, Stn187, Stn274, Stn192, Stn284, Stn256</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">missing bd: Stn313, Stn193 (but only 5 ad)</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">missing ac, bc (ab x dd): Stn72, Stn191</span>
seg.types[match(c(<span style="color: #4E9A06;">"Stn72"</span>, <span style="color: #4E9A06;">"Stn191"</span>), names(fam4.geno[-1]))] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"&lt;abxdd&gt;"</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">missing bc (and only 2 ac, maybe ab x dd): Stn104</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">missing bc, bd (aa x cd): Stn295, Stn308</span>
seg.types[match(c(<span style="color: #4E9A06;">"Stn295"</span>, <span style="color: #4E9A06;">"Stn308"</span>), names(fam4.geno[-1]))] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"&lt;aaxcd&gt;"</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">missing ad, bd (ab x cc): Stn202, Stn105</span>
seg.types[match(c(<span style="color: #4E9A06;">"Stn202"</span>, <span style="color: #4E9A06;">"Stn105"</span>), names(fam4.geno[-1]))] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"&lt;abxcc&gt;"</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">only 1 ac and 1 bc (maybe ab x dd): Stn186</span>
table(unlist( fam4.geno[,match(<span style="color: #4E9A06;">"Stn186"</span>, names(fam4.geno))] ))
<span style="color: #204A87;">## </span><span style="color: #204A87;">only 1 bc: Stn298</span>
table(unlist( fam4.geno[,match(<span style="color: #4E9A06;">"Stn298"</span>, names(fam4.geno))] ))
<span style="color: #204A87;">## </span><span style="color: #204A87;">only 1 bd (should be ab x ab): EaagMcac1</span>
table(unlist( fam4.geno[,match(<span style="color: #4E9A06;">"EaagMcac1"</span>, names(fam4.geno))] ))
fam4.geno$EaagMcac1[ fam4.geno$EaagMcac1 == <span style="color: #4E9A06;">"bd"</span> ] <span style="color: #F5666D;">&lt;-</span> <span style="color: #2F8B58; font-weight: bold;">NA</span>
seg.types[match(<span style="color: #4E9A06;">"EaagMcac1"</span>, names(fam4.geno[-1]))] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"&lt;abxab&gt;"</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Remove markers that had high error rates in the linkage map</span>
x <span style="color: #F5666D;">&lt;-</span> match(c(<span style="color: #4E9A06;">"Stn114"</span>, <span style="color: #4E9A06;">"Stn286"</span>, <span style="color: #4E9A06;">"Gac2111"</span>, <span style="color: #4E9A06;">"Stn24"</span>, <span style="color: #4E9A06;">"Stn71"</span>, <span style="color: #4E9A06;">"Stn118"</span>, <span style="color: #4E9A06;">"Stn232"</span>,
             <span style="color: #4E9A06;">"Stn138"</span>, <span style="color: #4E9A06;">"Stn196"</span>, <span style="color: #4E9A06;">"Stn114"</span>, <span style="color: #4E9A06;">"Stn21"</span>, <span style="color: #4E9A06;">"Stn277"</span>), names(fam4.geno))
fam4.geno <span style="color: #F5666D;">&lt;-</span> fam4.geno[, -x]
seg.types <span style="color: #F5666D;">&lt;-</span> seg.types[ -(x-1) ]

<span style="color: #204A87;">## </span><span style="color: #204A87;">Remove markers that have identical positions to other markers</span>
x <span style="color: #F5666D;">&lt;-</span> match(c(<span style="color: #4E9A06;">"Stn265"</span>, <span style="color: #4E9A06;">"Hoxc95."</span>, <span style="color: #4E9A06;">"Hoxc9F2.R2"</span>, <span style="color: #4E9A06;">"Stn152"</span>, <span style="color: #4E9A06;">"Stn267"</span>, <span style="color: #4E9A06;">"Stn176"</span>,
             <span style="color: #4E9A06;">"Stn191"</span>, <span style="color: #4E9A06;">"Stn284"</span>, <span style="color: #4E9A06;">"Stn193"</span>, <span style="color: #4E9A06;">"Stn188"</span>, <span style="color: #4E9A06;">"Stn274"</span>, <span style="color: #4E9A06;">"hoxabce1"</span>,
             <span style="color: #4E9A06;">"Hoxa10b"</span>, <span style="color: #4E9A06;">"cm488"</span>, <span style="color: #4E9A06;">"marker1"</span>, <span style="color: #4E9A06;">"Stn285"</span>, <span style="color: #4E9A06;">"Stn99"</span>, <span style="color: #4E9A06;">"Stn106"</span>,
             <span style="color: #4E9A06;">"Stn225"</span>, <span style="color: #4E9A06;">"Stn278"</span>, <span style="color: #4E9A06;">"Stn139"</span>, <span style="color: #4E9A06;">"Stn142"</span>, <span style="color: #4E9A06;">"Stn295"</span>, <span style="color: #4E9A06;">"cm820.821"</span>,
             <span style="color: #4E9A06;">"H9green1pel"</span>, <span style="color: #4E9A06;">"F10blue5.pel"</span>, <span style="color: #4E9A06;">"Stn78"</span>, <span style="color: #4E9A06;">"Stn246"</span>, <span style="color: #4E9A06;">"Stn276"</span>,
             <span style="color: #4E9A06;">"Stn155"</span>, <span style="color: #4E9A06;">"Stn7"</span>, <span style="color: #4E9A06;">"Stn321"</span>), names(fam4.geno))
fam4.geno <span style="color: #F5666D;">&lt;-</span> fam4.geno[, -x]
seg.types <span style="color: #F5666D;">&lt;-</span> seg.types[ -(x-1) ]

<span style="color: #204A87;">## </span><span style="color: #204A87;">375 fish, 244 markers</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Stn133 is dropped later during linkage map construction</span>

<span style="color: #204A87;">## </span><span style="color: #204A87;">Output Family 4 genotypes for building linkage map based on outbred (4-way) data</span>
table(seg.types)
table(unlist(fam4.geno[,-1]), useNA=<span style="color: #4E9A06;">"always"</span>)
fam4.geno$Fish <span style="color: #F5666D;">&lt;-</span> paste0(<span style="color: #4E9A06;">"4-"</span>, fam4.geno$Fish)
fam4.geno[ is.na(fam4.geno) ] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"--"</span>
write.csv(fam4.geno, <span style="color: #4E9A06;">"data/fam4.geno.csv"</span>, row.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
x <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"linkage_map/tmap_genotypes_fam4_outbred.txt"</span>
write.table(<span style="color: #4E9A06;">"data type outbred"</span>, x, col.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, row.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, quote=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
write.table(paste(dim(fam4.geno)[1], dim(fam4.geno)[2]-1, collapse=<span style="color: #4E9A06;">" "</span>), x, append=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>, col.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>,
            row.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, quote=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
write.table(cbind(as.vector(names(fam4.geno)[2:dim(fam4.geno)[2]]), seg.types,
                  t(fam4.geno[,2:dim(fam4.geno)[2]])), x, quote=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, sep=<span style="color: #4E9A06;">"\t"</span>,append=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>,
            col.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, row.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
</pre>
</div>
</div>
</div>
