QTL_mapping.org
** Build linkage map using Family 4 genotype data

Using tmap and the associated phasing and jtmap programs (Cartwright 2007)

Determine phasing
#+BEGIN_SRC sh :results output :eval no-export
  phasing linkage_map/tmap_genotypes_fam4_outbred.txt linkage_map/tmap_fam4_outbred.phased
#+END_SRC

#+RESULTS:
: Used a LOD threshold of 2.5000

Assign markers to groups using the jtmap Grouping interface
#+BEGIN_SRC sh :results none :eval no-export
jtmap Grouping tmap_fam4_outbred.phased &
#+END_SRC

Chose max distance 40, min LOD 4

Ignore Stn133 because it doesn't seem to go with group 11

Saved Stn204, Stn335 as group 22
Saved Stn249, Stn264 as group 23

Save results as linkage_map/tmap_fam4_outbred_*.grp files

Build linkage map using assigned groups
#+BEGIN_SRC sh :results none :eval no-export
  cd linkage_map
  for i in $( ls *.grp ); do
        tmap -b tmap_fam4_outbred.phased $i > $(basename "$i" .grp).bld
  done
#+END_SRC

Using jtmap MapViewer, flip groups 2, 3, 4, 5, 7, 8, 9, 11, 12, 13, 18, 19
to get a more familiar marker order


