QTL_mapping.html


<div id="outline-container-orgb96bca8" class="outline-3">
<h3 id="orgb96bca8">Build linkage map using Family 4 genotype data</h3>
<div class="outline-text-3" id="text-orgb96bca8">
<p>
Using tmap and the associated phasing and jtmap programs (Cartwright 2007)
</p>

<p>
Determine phasing
</p>
<div class="org-src-container">
<pre class="src src-sh">phasing linkage_map/tmap_genotypes_fam4_outbred.txt linkage_map/tmap_fam4_outbred.phased
</pre>
</div>

<pre class="example">
Used a LOD threshold of 2.5000

</pre>

<p>
Assign markers to groups using the jtmap Grouping interface
</p>
<div class="org-src-container">
<pre class="src src-sh">jtmap Grouping tmap_fam4_outbred.phased &amp;
</pre>
</div>

<p>
Chose max distance 40, min LOD 4
</p>

<p>
Ignore Stn133 because it doesn't seem to go with group 11
</p>

<p>
Saved Stn204, Stn335 as group 22
Saved Stn249, Stn264 as group 23
</p>

<p>
Save results as linkage_map/tmap_fam4_outbred_*.grp files
</p>

<p>
Build linkage map using assigned groups
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #A020F0;">cd</span> linkage_map
<span style="color: #A52A2A; font-weight: bold;">for</span> i<span style="color: #A52A2A; font-weight: bold;"> in</span> $( ls *.grp ); <span style="color: #A52A2A; font-weight: bold;">do</span>
      tmap -b tmap_fam4_outbred.phased $<span style="color: #0084C8; font-weight: bold;">i</span> &gt; $(<span style="color: #ff00ff;">basename</span> <span style="color: #4E9A06;">"$i"</span> .grp).bld
<span style="color: #A52A2A; font-weight: bold;">done</span>
</pre>
</div>

<p>
Using jtmap MapViewer, flip groups 2, 3, 4, 5, 7, 8, 9, 11, 12, 13, 18, 19
to get a more familiar marker order
</p>
</div>
</div>
