QTL_mapping.org
** QTL analysis of Family 4 as outbred cross

#+begin_src R
  library(qtl)

  ## Load Family 4 genotypes and phenotypes
  fam4.geno <- read.csv("data/fam4.geno.csv", stringsAsFactors=FALSE)
  fam4.pheno <- read.csv("data/fam4.pheno.csv", stringsAsFactors=FALSE)

  ## Load phased genotypes from tmap output
  tmap.phasing <- read.table("linkage_map/tmap_fam4_outbred.phased",
                             header=FALSE, sep=" ", quote="", skip=2,
                             comment.char="", stringsAsFactors=FALSE,)

  ## Make a data frame of the linkage map
  files <- sapply(1:23, function(i){
      paste0("linkage_map/tmap_fam4_outbred_", formatC(i, width=2, flag="0"),".bld")})
  groups <- lapply(files, function(f){
      x <- read.table(f, header=TRUE, sep="\t", quote="", stringsAsFactors=FALSE,
                      row.names=NULL, comment.char="", strip.white=TRUE)
      names(x) <- c("marker", "pos", "dist", "error", "informative")
      x$informative <- as.factor(x$informative)
      x})
  tmap.groups <- data.frame(marker=character(0), group=factor(levels=1:length(groups)),
                            pos=numeric(0), stringsAsFactors=FALSE)
  for(i in 1:length(groups)){
      tmap.groups <- rbind(tmap.groups,
                           data.frame(marker=groups[[i]]$marker,
                                      group=factor(i, levels=1:length(groups)),
                                      pos=groups[[i]]$pos, stringsAsFactors=FALSE))}
  rm(files,groups)


  ## Convert tmap phasing codes to R/qtl phased genotypes
  p <- strsplit(tmap.phasing[,2],"")
  p <- lapply(p, function(x){
                    as.numeric(sapply(x, function(y){switch(y,
                                                            "3"=7, "4"=3, "6"=10,
                                                            "7"=14, "8"=4, "a"=6,
                                                            "b"=13, "c"=8, "d"=12,
                                                            "e"=11, "f"=NA, "-"=NA,
                                                            y)},USE.NAMES=FALSE))})
  ## Make a data frame of the phased genotypes
  p <- as.data.frame(t(as.data.frame(p)))
  names(p) <- fam4.geno$Fish
  rownames(p) <- names(fam4.geno)[-1]
  ## Select just the subset of markers that are in the linkage map
  ## and put them in the map order
  p <- t( p[match(tmap.groups$marker, rownames(p)),] )


  ## Format genotype data for R/qtl
  tmap.groups$pos <- as.character(tmap.groups$pos)
  tmap.groups <- rbind(t(tmap.groups), p)
  rm(p)


  ## Calculate residuals to standard length and/or sex
  ## Also consider body depth as a model variable
  ## Choose which model to use based on F statistic
  fam4.pheno$Sex <- as.factor(fam4.pheno$Sex)
  for(i in 6:10){
      p <- fam4.pheno[, c(1:5, i)]
      names(p)[6] <- "trait"
      m1 <- lm( trait ~ SL, data=p)
      m2 <- lm( trait ~ SL + Sex, data=p)
      m3 <- lm( trait ~ Sex, data=p)
      m4 <- lm( trait ~ BD, data=p)
      m5 <- lm( trait ~ BD + SL, data=p)
      m6 <- lm( trait ~ BD + SL + Sex, data=p)
      m7 <- lm( trait ~ BD + Sex, data=p)
      m <- list(m1,m2,m3,m4,m5,m6,m7)
      p.val <- as.vector(sapply(m, function(x){
          pf(summary(x)$fstatistic["value"],
             summary(x)$fstatistic["numdf"],
             summary(x)$fstatistic["dendf"],
             lower.tail=FALSE)}))
      j <- as.integer(which( p.val == min(p.val) ))
      if( min(p.val) > 0.01 ){ print("WARNING: P > 0.01"); print(c(i,j)) }
      if( length(j) > 1 ){
          print("WARNING: TIE FOR BEST MODEL")
          print(c(i,j))
          j <- j[1]
      }
      k <- list(!is.na(fam4.pheno[,i]) & !is.na(fam4.pheno$SL),
                !is.na(fam4.pheno[,i]) & !is.na(fam4.pheno$SL) & !is.na(fam4.pheno$Sex),
                !is.na(fam4.pheno[,i]) & !is.na(fam4.pheno$Sex),
                !is.na(fam4.pheno[,i]) & !is.na(fam4.pheno$BD),
                !is.na(fam4.pheno[,i]) & !is.na(fam4.pheno$BD) & !is.na(fam4.pheno$SL),
                !is.na(fam4.pheno[,i]) & !is.na(fam4.pheno$BD) & !is.na(fam4.pheno$SL) & !is.na(fam4.pheno$Sex),
                !is.na(fam4.pheno[,i]) & !is.na(fam4.pheno$BD) & !is.na(fam4.pheno$Sex))
      fam4.pheno[k[[j]],paste0(names(fam4.pheno)[i],"_rsd",j)] <- residuals(m[[j]])
  }
  ## Spine 1 and Spine 2 use model 1 (standard length)
  ## Spine 3 and Anal Spine use model 2 (standard length and sex)
  ## Spine 1 (with zeros included for missing spines) uses model 2


  ## Combine phenotypes with genotypes for cross file
  p <- fam4.pheno[match(rownames(tmap.groups), fam4.pheno$Fish, nomatch=NULL), c(2:length(fam4.pheno))]
  lapply(p, is.factor) # which traits are specified as factors? only sex
  p$Sex <- as.character(p$Sex) # convert to character for the purposes of writing the file
  p[1,] <- names(p)
  p[2:3,] <- ""

  ## Phenotype data should use the same NA strings as in read.cross
  sum( p[4:dim(p)[1],]=="", na.rm=TRUE)  # check that there aren't any "empty string" missing values
  sum( is.na(p[4:dim(p)[1],]))           # how many NAs?
  table(which(p == 0, arr.ind=TRUE)[,"col"])  # which columns contain 0 values? 15 in Spine_1_w_0 column
  names(p)[as.numeric(names(table(which(p == 0, arr.ind=TRUE)[,"col"])))] # show the names of those columns

  ## Combine phenotype and phased genotype data
  tmap.groups <- cbind(p, tmap.groups, stringsAsFactors=FALSE)

  ## Write cross file and read it with R/qtl
  write.table(tmap.groups, "data/cross_fam4.csv", col.names=FALSE, row.names=FALSE, sep=",", quote=FALSE)
  cross <- read.cross(format="csv", file="data/cross_fam4.csv", estimate.map=FALSE, genotypes=NULL)
  cross <- jittermap(cross)    # jittermap needed because some markers have identical position
  cross <- calc.genoprob(cross, step=0, error.prob=0.0001, map.function="kosambi") # tmap uses kosambi
  summary(cross)


  ## Select phenotypes to analyze
  p <- 3:14       # all phenotypes (raw and residuals)
  cross$pheno$sex.numeric <- as.numeric(cross$pheno$Sex) - 1
  cross$pheno$Spine_1_present <- as.numeric( !(cross$pheno$Spine_1_w_0 == 0) )
  p.bin <- 15:16  # binary phenotypes (sex and spine 1 presence/absence)
  p.2p <- 6       # 2-part phenotypes (Spine 1 with zeros for missing)


  ## Run scanone using hk for normal traits and em for binary traits
  np <- 10000 # number of permutations for permutation test
  nc <- 8     # number of cores to use (make sure np divisible by nc)
  out.hk <- scanone(cross, pheno.col=p, model="normal", method="hk")
  out.bin <- scanone(cross, pheno.col=p.bin, model="binary", method="em")
  out.2p <- scanone(cross, pheno.col=p.2p, model="2part", method="em")

  load("data/scanone.permutations.RData")  # load precalculated scanone permutations
  ## Uncomment here to re-rerun the scanone permutations
  #perm.hk <- scanone(cross, pheno.col=p, model="normal", method="hk",
  #                    n.perm=np, n.cluster=nc)
  #perm.bin <- scanone(cross, pheno.col=p.bin, model="binary", method="em",
  #                    n.perm=np, n.cluster=nc)
  #perm.2p <- scanone(cross, pheno.col=p.2p, model="2part", method="em",
  #                    n.perm=np, n.cluster=nc)

  ## Generate simple plots of all scanone results
  for(i in seq_along(p)){
      png(paste0("plots/qtl_normal_hk_",formatC(p[i], width=2, flag="0"),".png"), 1200, 400)
      plot(out.hk, lodcolumn=i)
      add.threshold(out.hk, perms=perm.hk, alpha=0.05, lodcolumn=i, lty=4)
      dev.off()
  }
  for(i in seq_along(p.bin)){
      png(paste0("plots/qtl_binary_",formatC(p.bin[i], width=2, flag="0"),".png"), 1200, 400)
      plot(out.bin, lodcolumn=i)
      add.threshold(out.bin, perms=perm.bin, alpha=0.05, lodcolumn=i, lty=4)
      dev.off()
  }
  png(paste0("plots/qtl_2part_",formatC(p.2p, width=2, flag="0"),".png"), 1200, 400)
  plot(out.2p, lodcolumn=1:3, ylab="LOD score")
  add.threshold(out.2p, perms=perm.2p, alpha=0.05, lodcolumn=1, lty=4)
  dev.off()



  ## Display scanone results for spine length residuals
  ## Summarize LOD scores that pass permutation-based threshold
  ## Calculate PVE values corresponding to top LOD score
  i <- match(c("Spine_1_rsd1","Spine_2_rsd1","Spine_3_rsd2","Anal_Spine_rsd2"), names(cross$pheno)[p])
  summary(out.hk, perms=perm.hk, alpha=.05, lodcolumn=i[1])[,c(1:2,i[1]+2)]
  sum(!is.na(cross$pheno$Spine_1_rsd1))
  print(1-10^(-2/360 * 25.97)) # 28.3% PVE Stn47
  summary(out.hk, perms=perm.hk, alpha=.05, lodcolumn=i[2])[,c(1:2,i[2]+2)]
  sum(!is.na(cross$pheno$Spine_2_rsd1))
  print(1-10^(-2/372 * 30.45)) # 31.4% PVE Stn45
  summary(out.hk, perms=perm.hk, alpha=.05, lodcolumn=i[3])[,c(1:2,i[3]+2)]
  sum(!is.na(cross$pheno$Spine_3_rsd2))
  print(1-10^(-2/368 * 15.64)) # 17.8% PVE Stn45
  summary(out.hk, perms=perm.hk, alpha=.05, lodcolumn=i[4])[,c(1:2,i[4]+2)]
  sum(!is.na(cross$pheno$Anal_Spine_rsd2))
  print(1-10^(-2/334 * 16.79)) # 20.7% PVE Stn292
  summary(out.hk, perms=perm.hk, alpha=.05, format="tabByCol", pvalues=TRUE)


  ## Plot scanone results on chromosome 4
  #plot(out.hk, lodcolumn=i[2], chr=4, show.marker.names=TRUE, col="red", ylab="LOD")
  plot(out.hk, lodcolumn=i[2], chr=4, col="red", ylab="LOD")
  plot(out.hk, lodcolumn=i[1], chr=4, col="blue", add=TRUE)
  plot(out.hk, lodcolumn=i[3], chr=4, col="green", add=TRUE)
  plot(out.hk, lodcolumn=i[4], chr=4, col="orange", add=TRUE)
  add.threshold(out.hk, perms=perm.hk, alpha=0.05, lodcolumn=i[1], lty=4)
  legend(8, 26, c("DS1", "DS2", "DS3", "AS"), fill=c("blue","red","green","orange"), bty="n")


  ## Plot scanone results across entire genome
  ## (linkage groups 1 through 21)
  pdf("plots/spine_qtl_plot.pdf", width=8, height=3.5)
  pcolors <- c("royalblue","indianred2","darkseagreen","gold2")
  par.old <- par(mar=c(4,4,1.8,1), mgp=c(2.4,.8,0))
  plot(out.hk, lodcolumn=i[2], chr=1:21, col=pcolors[2], ylab="LOD", alternate.chrid=TRUE, bty="l")
  plot(out.hk, lodcolumn=i[1], chr=1:21, col=pcolors[1], add=TRUE)
  plot(out.hk, lodcolumn=i[3], chr=1:21, col=pcolors[3], add=TRUE)
  plot(out.hk, lodcolumn=i[4], chr=1:21, col=pcolors[4], add=TRUE)
  add.threshold(out.hk, perms=perm.hk, alpha=0.05, lodcolumn=i[1], lty=4)
  legend(40, 26, c("DS1", "DS2", "DS3", "AS"), fill=pcolors, bty="n")
  par(par.old)
  dev.off()


  ## Run scantwo on selected phenotypes
  np <- 10000  # 10000 perms took 6.5 hours on 40 cores; 1000 perms may be adequate
  nc <- 40
  i <- match(c("Spine_1_rsd1","Spine_2_rsd1","Spine_3_rsd2","Anal_Spine_rsd2"), names(cross$pheno)[p])
  out2.hk <- scantwo(cross, pheno.col=p[i], model="normal", method="hk")

  load("data/scantwo.permutations.RData")  # load precalculated scantwo permutations
  ## Uncomment here to re-run the scantwo permutations
  #perm2.hk <- scantwo(cross, pheno.col=p[i], model="normal", method="hk",
  #                     n.perm=np, n.cluster=nc)


  ## Determine penalties for stepwise analysis
  pen <- calc.penalties(perm2.hk, alpha=.05)
  pen.avg <- apply(pen, 2, mean)


  ## Stepwise model selection
  j <- match(c("Spine_1_rsd1","Spine_2_rsd1","Spine_3_rsd2","Anal_Spine_rsd2"), names(cross$pheno)[p])
  for(i in 1:length(j)){
      stepout.a <- stepwiseqtl(cross, additive.only=TRUE, max.qtl=10, method="hk",
                               pheno.col=p[j[i]], penalties=pen[i,])
      if(i==1){stp.1 <- stepout.a}
      if(i==2){stp.2 <- stepout.a}
      if(i==3){stp.3 <- stepout.a}
      if(i==4){stp.4 <- stepout.a}
      print(names(cross$pheno)[p[j[i]]])
      print(stepout.a)
      print(summary(fitqtl(cross, pheno.col=p[j[i]], qtl=stepout.a, method="hk")))

      ##  No interactions were retained during model selection
      #stepout.i <- stepwiseqtl(cross, max.qtl=10, method="hk",
      #                     pheno.col=p[j[i]], penalties=pen[i,])
      #print(stepout.i)
      #print(summary(fitqtl(cross, pheno.col=p[j[i]], qtl=stepout.i, method="hk",
      #                     formula=attributes(stepout.i)$formula)))
  }

  ## Saved model selection output to data/stepwise_model_selection_output.txt



  ## Use effectplot to get phenotype means for each genotype
  cross <- sim.geno(cross, n.draws=64, map.function="kosambi")
  find.marker(cross, chr=4, pos=61.4)
  find.marker(cross, chr=7, pos=85.8)
  find.marker(cross, chr=16, pos=13.5)
  print(effectplot(cross, pheno.col=p[j[1]], mname1="Stn47"))
  print(effectplot(cross, pheno.col=p[j[1]], mname1="Stn82"))
  print(effectplot(cross, pheno.col=p[j[1]], mname1="Stn175"))
  find.marker(cross, chr=4, pos=55.3)
  find.marker(cross, chr=8, pos=42)
  find.marker(cross, chr=9, pos=8.7)
  find.marker(cross, chr=16, pos=13.5)
  print(effectplot(cross, pheno.col=p[j[2]], mname1="Stn45"))
  print(effectplot(cross, pheno.col=p[j[2]], mname1="Stn87"))
  print(effectplot(cross, pheno.col=p[j[2]], mname1="Stn108"))
  print(effectplot(cross, pheno.col=p[j[2]], mname1="Stn175"))
  find.marker(cross, chr=4, pos=55.0)
  find.marker(cross, chr=13, pos=4.8)
  find.marker(cross, chr=21, pos=0)
  print(effectplot(cross, pheno.col=p[j[3]], mname1="Gac4174"))
  print(effectplot(cross, pheno.col=p[j[3]], mname1="Stn149"))
  print(effectplot(cross, pheno.col=p[j[3]], mname1="Stn218"))
  find.marker(cross, chr=4, pos=63.5)
  find.marker(cross, chr=17, pos=45.8)
  find.marker(cross, chr=20, pos=0)
  print(effectplot(cross, pheno.col=p[j[4]], mname1="Stn292"))
  print(effectplot(cross, pheno.col=p[j[4]], mname1="Stn273"))
  print(effectplot(cross, pheno.col=p[j[4]], mname1="Stn213"))


  ## Build a table of phenotype means per genotype at QTL
  ptable <- effectplot(cross, pheno.col=p[j[1]], mname1="Stn47")$Means
  ptable <- as.data.frame(t(ptable))
  names(ptable) <- c("M2F1","M1M2","F1F2","M1F2")
  ptable <- ptable[,c("M1M2","M2F1","M1F2","F1F2")]
  tmp <- effectplot(cross, pheno.col=p[j[1]], mname1="Stn82")$Means
  ptable <- rbind( ptable, tmp[c(3,4,1,2)] )
  tmp <- effectplot(cross, pheno.col=p[j[1]], mname1="Stn175")$Means
  ptable <- rbind( ptable, tmp )
  tmp <- effectplot(cross, pheno.col=p[j[2]], mname1="Stn45")$Means
  ptable <- rbind( ptable, tmp[c(2,1,4,3)] )
  tmp <- effectplot(cross, pheno.col=p[j[2]], mname1="Stn87")$Means
  ptable <- rbind( ptable, tmp[c(3,4,1,2)] )
  tmp <- effectplot(cross, pheno.col=p[j[2]], mname1="Stn108")$Means
  ptable <- rbind( ptable, tmp )
  tmp <- effectplot(cross, pheno.col=p[j[2]], mname1="Stn175")$Means
  ptable <- rbind( ptable, tmp )
  tmp <- effectplot(cross, pheno.col=p[j[3]], mname1="Gac4174")$Means
  ptable <- rbind( ptable, tmp[c(2,1,4,3)] )
  tmp <- effectplot(cross, pheno.col=p[j[3]], mname1="Stn149")$Means
  ptable <- rbind( ptable, tmp[c(4,3,2,1)] )
  tmp <- effectplot(cross, pheno.col=p[j[3]], mname1="Stn218")$Means
  ptable <- rbind( ptable, tmp[c(3,4,1,2)] )
  tmp <- effectplot(cross, pheno.col=p[j[4]], mname1="Stn292")$Means
  ptable <- rbind( ptable, tmp[c(2,1,4,3)] )
  tmp <- effectplot(cross, pheno.col=p[j[4]], mname1="Stn273")$Means
  ptable <- rbind( ptable, tmp[c(3,4,1,2)] )
  tmp <- effectplot(cross, pheno.col=p[j[4]], mname1="Stn213")$Means
  ptable <- rbind( ptable, tmp )


  ## LOD scores for dropping one QTL at a time from each model
  qtable1 <- summary(fitqtl(cross, pheno.col=p[j[1]], qtl=stp.1, method="hk"))$result.drop[,]
  qtable2 <- summary(fitqtl(cross, pheno.col=p[j[2]], qtl=stp.2, method="hk"))$result.drop[,]
  qtable3 <- summary(fitqtl(cross, pheno.col=p[j[3]], qtl=stp.3, method="hk"))$result.drop[,]
  qtable4 <- summary(fitqtl(cross, pheno.col=p[j[4]], qtl=stp.4, method="hk"))$result.drop[,]
  qtable1 <- as.data.frame(qtable1)
  qtable2 <- as.data.frame(qtable2)
  qtable3 <- as.data.frame(qtable3)
  qtable4 <- as.data.frame(qtable4)


  ## Combine phenotype means, LOD scores and PVE into a table
  markers <- c("Stn47","Stn82","Stn175","Stn45","Stn87","Stn108","Stn175","Gac4174","Stn149",
               "Stn218","Stn292", "Stn273", "Stn213")
  etable <- data.frame(Trait=c(rep("DS1",3),rep("DS2",4),rep("DS3",3),rep("AS",3)),
                       Chromosome=c(4, 7, 16, 4, 8, 9, 16, 4, 13, 21, 4, 17, 20),
                       Position=c(floor(stp.1$pos*10)/10,floor(stp.2$pos*10)/10,
                                  floor(stp.3$pos*10)/10,floor(stp.4$pos*10)/10),
                       Marker=markers, LOD=c(qtable1$LOD,qtable2$LOD,qtable3$LOD,qtable4$LOD),
                       PVE=c(qtable1[,"%var"],qtable2[,"%var"],qtable3[,"%var"],qtable4[,"%var"]))
  ptable <- cbind(etable, ptable)
  print(ptable)


  ## Generate LaTeX table
  library(xtable)
  print(xtable(ptable, rownames=FALSE), include.rownames=FALSE)
#+end_src




