QTL_mapping.html


<div id="outline-container-orge06a6eb" class="outline-3">
<h3 id="orge06a6eb">QTL analysis of Family 4 as outbred cross</h3>
<div class="outline-text-3" id="text-orge06a6eb">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #F5666D;">library</span>(qtl)

<span style="color: #204A87;">## </span><span style="color: #204A87;">Load Family 4 genotypes and phenotypes</span>
fam4.geno <span style="color: #F5666D;">&lt;-</span> read.csv(<span style="color: #4E9A06;">"data/fam4.geno.csv"</span>, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
fam4.pheno <span style="color: #F5666D;">&lt;-</span> read.csv(<span style="color: #4E9A06;">"data/fam4.pheno.csv"</span>, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)

<span style="color: #204A87;">## </span><span style="color: #204A87;">Load phased genotypes from tmap output</span>
tmap.phasing <span style="color: #F5666D;">&lt;-</span> read.table(<span style="color: #4E9A06;">"linkage_map/tmap_fam4_outbred.phased"</span>,
                           header=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, sep=<span style="color: #4E9A06;">" "</span>, quote=<span style="color: #4E9A06;">""</span>, skip=2,
                           comment.char=<span style="color: #4E9A06;">""</span>, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>,)

<span style="color: #204A87;">## </span><span style="color: #204A87;">Make a data frame of the linkage map</span>
files <span style="color: #F5666D;">&lt;-</span> sapply(1:23, <span style="color: #A52A2A; font-weight: bold;">function</span>(i){
    paste0(<span style="color: #4E9A06;">"linkage_map/tmap_fam4_outbred_"</span>, formatC(i, width=2, flag=<span style="color: #4E9A06;">"0"</span>),<span style="color: #4E9A06;">".bld"</span>)})
groups <span style="color: #F5666D;">&lt;-</span> lapply(files, <span style="color: #A52A2A; font-weight: bold;">function</span>(f){
    x <span style="color: #F5666D;">&lt;-</span> read.table(f, header=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>, sep=<span style="color: #4E9A06;">"\t"</span>, quote=<span style="color: #4E9A06;">""</span>, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>,
                    row.names=<span style="color: #2F8B58; font-weight: bold;">NULL</span>, comment.char=<span style="color: #4E9A06;">""</span>, strip.white=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
    names(x) <span style="color: #F5666D;">&lt;-</span> c(<span style="color: #4E9A06;">"marker"</span>, <span style="color: #4E9A06;">"pos"</span>, <span style="color: #4E9A06;">"dist"</span>, <span style="color: #4E9A06;">"error"</span>, <span style="color: #4E9A06;">"informative"</span>)
    x$informative <span style="color: #F5666D;">&lt;-</span> as.factor(x$informative)
    x})
tmap.groups <span style="color: #F5666D;">&lt;-</span> data.frame(marker=character(0), group=factor(levels=1:length(groups)),
                          pos=numeric(0), stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> 1:length(groups)){
    tmap.groups <span style="color: #F5666D;">&lt;-</span> rbind(tmap.groups,
                         data.frame(marker=groups[[i]]$marker,
                                    group=factor(i, levels=1:length(groups)),
                                    pos=groups[[i]]$pos, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>))}
rm(files,groups)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Convert tmap phasing codes to R/qtl phased genotypes</span>
p <span style="color: #F5666D;">&lt;-</span> strsplit(tmap.phasing[,2],<span style="color: #4E9A06;">""</span>)
p <span style="color: #F5666D;">&lt;-</span> lapply(p, <span style="color: #A52A2A; font-weight: bold;">function</span>(x){
                  as.numeric(sapply(x, <span style="color: #A52A2A; font-weight: bold;">function</span>(y){<span style="color: #A52A2A; font-weight: bold;">switch</span>(y,
                                                          <span style="color: #4E9A06;">"3"</span>=7, <span style="color: #4E9A06;">"4"</span>=3, <span style="color: #4E9A06;">"6"</span>=10,
                                                          <span style="color: #4E9A06;">"7"</span>=14, <span style="color: #4E9A06;">"8"</span>=4, <span style="color: #4E9A06;">"a"</span>=6,
                                                          <span style="color: #4E9A06;">"b"</span>=13, <span style="color: #4E9A06;">"c"</span>=8, <span style="color: #4E9A06;">"d"</span>=12,
                                                          <span style="color: #4E9A06;">"e"</span>=11, <span style="color: #4E9A06;">"f"</span>=<span style="color: #2F8B58; font-weight: bold;">NA</span>, <span style="color: #4E9A06;">"-"</span>=<span style="color: #2F8B58; font-weight: bold;">NA</span>,
                                                          y)},USE.NAMES=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>))})
<span style="color: #204A87;">## </span><span style="color: #204A87;">Make a data frame of the phased genotypes</span>
p <span style="color: #F5666D;">&lt;-</span> as.data.frame(t(as.data.frame(p)))
names(p) <span style="color: #F5666D;">&lt;-</span> fam4.geno$Fish
rownames(p) <span style="color: #F5666D;">&lt;-</span> names(fam4.geno)[-1]
<span style="color: #204A87;">## </span><span style="color: #204A87;">Select just the subset of markers that are in the linkage map</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">and put them in the map order</span>
p <span style="color: #F5666D;">&lt;-</span> t( p[match(tmap.groups$marker, rownames(p)),] )


<span style="color: #204A87;">## </span><span style="color: #204A87;">Format genotype data for R/qtl</span>
tmap.groups$pos <span style="color: #F5666D;">&lt;-</span> as.character(tmap.groups$pos)
tmap.groups <span style="color: #F5666D;">&lt;-</span> rbind(t(tmap.groups), p)
rm(p)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Calculate residuals to standard length and/or sex</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Also consider body depth as a model variable</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Choose which model to use based on F statistic</span>
fam4.pheno$Sex <span style="color: #F5666D;">&lt;-</span> as.factor(fam4.pheno$Sex)
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> 6:10){
    p <span style="color: #F5666D;">&lt;-</span> fam4.pheno[, c(1:5, i)]
    names(p)[6] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"trait"</span>
    m1 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ SL, data=p)
    m2 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ SL + Sex, data=p)
    m3 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ Sex, data=p)
    m4 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ BD, data=p)
    m5 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ BD + SL, data=p)
    m6 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ BD + SL + Sex, data=p)
    m7 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ BD + Sex, data=p)
    m <span style="color: #F5666D;">&lt;-</span> list(m1,m2,m3,m4,m5,m6,m7)
    p.val <span style="color: #F5666D;">&lt;-</span> as.vector(sapply(m, <span style="color: #A52A2A; font-weight: bold;">function</span>(x){
        pf(summary(x)$fstatistic[<span style="color: #4E9A06;">"value"</span>],
           summary(x)$fstatistic[<span style="color: #4E9A06;">"numdf"</span>],
           summary(x)$fstatistic[<span style="color: #4E9A06;">"dendf"</span>],
           lower.tail=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)}))
    j <span style="color: #F5666D;">&lt;-</span> as.integer(which( p.val == min(p.val) ))
    <span style="color: #A52A2A; font-weight: bold;">if</span>( min(p.val) &gt; 0.01 ){ print(<span style="color: #4E9A06;">"WARNING: P &gt; 0.01"</span>); print(c(i,j)) }
    <span style="color: #A52A2A; font-weight: bold;">if</span>( length(j) &gt; 1 ){
        print(<span style="color: #4E9A06;">"WARNING: TIE FOR BEST MODEL"</span>)
        print(c(i,j))
        j <span style="color: #F5666D;">&lt;-</span> j[1]
    }
    k <span style="color: #F5666D;">&lt;-</span> list(!is.na(fam4.pheno[,i]) &amp; !is.na(fam4.pheno$SL),
              !is.na(fam4.pheno[,i]) &amp; !is.na(fam4.pheno$SL) &amp; !is.na(fam4.pheno$Sex),
              !is.na(fam4.pheno[,i]) &amp; !is.na(fam4.pheno$Sex),
              !is.na(fam4.pheno[,i]) &amp; !is.na(fam4.pheno$BD),
              !is.na(fam4.pheno[,i]) &amp; !is.na(fam4.pheno$BD) &amp; !is.na(fam4.pheno$SL),
              !is.na(fam4.pheno[,i]) &amp; !is.na(fam4.pheno$BD) &amp; !is.na(fam4.pheno$SL) &amp; !is.na(fam4.pheno$Sex),
              !is.na(fam4.pheno[,i]) &amp; !is.na(fam4.pheno$BD) &amp; !is.na(fam4.pheno$Sex))
    fam4.pheno[k[[j]],paste0(names(fam4.pheno)[i],<span style="color: #4E9A06;">"_rsd"</span>,j)] <span style="color: #F5666D;">&lt;-</span> residuals(m[[j]])
}
<span style="color: #204A87;">## </span><span style="color: #204A87;">Spine 1 and Spine 2 use model 1 (standard length)</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Spine 3 and Anal Spine use model 2 (standard length and sex)</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Spine 1 (with zeros included for missing spines) uses model 2</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Combine phenotypes with genotypes for cross file</span>
p <span style="color: #F5666D;">&lt;-</span> fam4.pheno[match(rownames(tmap.groups), fam4.pheno$Fish, nomatch=<span style="color: #2F8B58; font-weight: bold;">NULL</span>), c(2:length(fam4.pheno))]
lapply(p, is.factor) <span style="color: #204A87;"># </span><span style="color: #204A87;">which traits are specified as factors? only sex</span>
p$Sex <span style="color: #F5666D;">&lt;-</span> as.character(p$Sex) <span style="color: #204A87;"># </span><span style="color: #204A87;">convert to character for the purposes of writing the file</span>
p[1,] <span style="color: #F5666D;">&lt;-</span> names(p)
p[2:3,] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">""</span>

<span style="color: #204A87;">## </span><span style="color: #204A87;">Phenotype data should use the same NA strings as in read.cross</span>
sum( p[4:dim(p)[1],]==<span style="color: #4E9A06;">""</span>, na.rm=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)  <span style="color: #204A87;"># </span><span style="color: #204A87;">check that there aren't any "empty string" missing values</span>
sum( is.na(p[4:dim(p)[1],]))           <span style="color: #204A87;"># </span><span style="color: #204A87;">how many NAs?</span>
table(which(p == 0, arr.ind=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)[,<span style="color: #4E9A06;">"col"</span>])  <span style="color: #204A87;"># </span><span style="color: #204A87;">which columns contain 0 values? 15 in Spine_1_w_0 column</span>
names(p)[as.numeric(names(table(which(p == 0, arr.ind=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)[,<span style="color: #4E9A06;">"col"</span>])))] <span style="color: #204A87;"># </span><span style="color: #204A87;">show the names of those columns</span>

<span style="color: #204A87;">## </span><span style="color: #204A87;">Combine phenotype and phased genotype data</span>
tmap.groups <span style="color: #F5666D;">&lt;-</span> cbind(p, tmap.groups, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)

<span style="color: #204A87;">## </span><span style="color: #204A87;">Write cross file and read it with R/qtl</span>
write.table(tmap.groups, <span style="color: #4E9A06;">"data/cross_fam4.csv"</span>, col.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, row.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, sep=<span style="color: #4E9A06;">","</span>, quote=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
cross <span style="color: #F5666D;">&lt;-</span> read.cross(format=<span style="color: #4E9A06;">"csv"</span>, file=<span style="color: #4E9A06;">"data/cross_fam4.csv"</span>, estimate.map=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, genotypes=<span style="color: #2F8B58; font-weight: bold;">NULL</span>)
cross <span style="color: #F5666D;">&lt;-</span> jittermap(cross)    <span style="color: #204A87;"># </span><span style="color: #204A87;">jittermap needed because some markers have identical position</span>
cross <span style="color: #F5666D;">&lt;-</span> calc.genoprob(cross, step=0, error.prob=0.0001, map.function=<span style="color: #4E9A06;">"kosambi"</span>) <span style="color: #204A87;"># </span><span style="color: #204A87;">tmap uses kosambi</span>
summary(cross)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Select phenotypes to analyze</span>
p <span style="color: #F5666D;">&lt;-</span> 3:14       <span style="color: #204A87;"># </span><span style="color: #204A87;">all phenotypes (raw and residuals)</span>
cross$pheno$sex.numeric <span style="color: #F5666D;">&lt;-</span> as.numeric(cross$pheno$Sex) - 1
cross$pheno$Spine_1_present <span style="color: #F5666D;">&lt;-</span> as.numeric( !(cross$pheno$Spine_1_w_0 == 0) )
p.bin <span style="color: #F5666D;">&lt;-</span> 15:16  <span style="color: #204A87;"># </span><span style="color: #204A87;">binary phenotypes (sex and spine 1 presence/absence)</span>
p.2p <span style="color: #F5666D;">&lt;-</span> 6       <span style="color: #204A87;"># </span><span style="color: #204A87;">2-part phenotypes (Spine 1 with zeros for missing)</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Run scanone using hk for normal traits and em for binary traits</span>
np <span style="color: #F5666D;">&lt;-</span> 10000 <span style="color: #204A87;"># </span><span style="color: #204A87;">number of permutations for permutation test</span>
nc <span style="color: #F5666D;">&lt;-</span> 8     <span style="color: #204A87;"># </span><span style="color: #204A87;">number of cores to use (make sure np divisible by nc)</span>
out.hk <span style="color: #F5666D;">&lt;-</span> scanone(cross, pheno.col=p, model=<span style="color: #4E9A06;">"normal"</span>, method=<span style="color: #4E9A06;">"hk"</span>)
out.bin <span style="color: #F5666D;">&lt;-</span> scanone(cross, pheno.col=p.bin, model=<span style="color: #4E9A06;">"binary"</span>, method=<span style="color: #4E9A06;">"em"</span>)
out.2p <span style="color: #F5666D;">&lt;-</span> scanone(cross, pheno.col=p.2p, model=<span style="color: #4E9A06;">"2part"</span>, method=<span style="color: #4E9A06;">"em"</span>)

load(<span style="color: #4E9A06;">"data/scanone.permutations.RData"</span>)  <span style="color: #204A87;"># </span><span style="color: #204A87;">load precalculated scanone permutations</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Uncomment here to re-rerun the scanone permutations</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">perm.hk &lt;- scanone(cross, pheno.col=p, model="normal", method="hk",</span>
<span style="color: #204A87;">#                    </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">perm.bin &lt;- scanone(cross, pheno.col=p.bin, model="binary", method="em",</span>
<span style="color: #204A87;">#                    </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">perm.2p &lt;- scanone(cross, pheno.col=p.2p, model="2part", method="em",</span>
<span style="color: #204A87;">#                    </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>

<span style="color: #204A87;">## </span><span style="color: #204A87;">Generate simple plots of all scanone results</span>
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> seq_along(p)){
    png(paste0(<span style="color: #4E9A06;">"plots/qtl_normal_hk_"</span>,formatC(p[i], width=2, flag=<span style="color: #4E9A06;">"0"</span>),<span style="color: #4E9A06;">".png"</span>), 1200, 400)
    plot(out.hk, lodcolumn=i)
    add.threshold(out.hk, perms=perm.hk, alpha=0.05, lodcolumn=i, lty=4)
    dev.off()
}
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> seq_along(p.bin)){
    png(paste0(<span style="color: #4E9A06;">"plots/qtl_binary_"</span>,formatC(p.bin[i], width=2, flag=<span style="color: #4E9A06;">"0"</span>),<span style="color: #4E9A06;">".png"</span>), 1200, 400)
    plot(out.bin, lodcolumn=i)
    add.threshold(out.bin, perms=perm.bin, alpha=0.05, lodcolumn=i, lty=4)
    dev.off()
}
png(paste0(<span style="color: #4E9A06;">"plots/qtl_2part_"</span>,formatC(p.2p, width=2, flag=<span style="color: #4E9A06;">"0"</span>),<span style="color: #4E9A06;">".png"</span>), 1200, 400)
plot(out.2p, lodcolumn=1:3, ylab=<span style="color: #4E9A06;">"LOD score"</span>)
add.threshold(out.2p, perms=perm.2p, alpha=0.05, lodcolumn=1, lty=4)
dev.off()



<span style="color: #204A87;">## </span><span style="color: #204A87;">Display scanone results for spine length residuals</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Summarize LOD scores that pass permutation-based threshold</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Calculate PVE values corresponding to top LOD score</span>
i <span style="color: #F5666D;">&lt;-</span> match(c(<span style="color: #4E9A06;">"Spine_1_rsd1"</span>,<span style="color: #4E9A06;">"Spine_2_rsd1"</span>,<span style="color: #4E9A06;">"Spine_3_rsd2"</span>,<span style="color: #4E9A06;">"Anal_Spine_rsd2"</span>), names(cross$pheno)[p])
summary(out.hk, perms=perm.hk, alpha=.05, lodcolumn=i[1])[,c(1:2,i[1]+2)]
sum(!is.na(cross$pheno$Spine_1_rsd1))
print(1-10^(-2/360 * 25.97)) <span style="color: #204A87;"># </span><span style="color: #204A87;">28.3% PVE Stn47</span>
summary(out.hk, perms=perm.hk, alpha=.05, lodcolumn=i[2])[,c(1:2,i[2]+2)]
sum(!is.na(cross$pheno$Spine_2_rsd1))
print(1-10^(-2/372 * 30.45)) <span style="color: #204A87;"># </span><span style="color: #204A87;">31.4% PVE Stn45</span>
summary(out.hk, perms=perm.hk, alpha=.05, lodcolumn=i[3])[,c(1:2,i[3]+2)]
sum(!is.na(cross$pheno$Spine_3_rsd2))
print(1-10^(-2/368 * 15.64)) <span style="color: #204A87;"># </span><span style="color: #204A87;">17.8% PVE Stn45</span>
summary(out.hk, perms=perm.hk, alpha=.05, lodcolumn=i[4])[,c(1:2,i[4]+2)]
sum(!is.na(cross$pheno$Anal_Spine_rsd2))
print(1-10^(-2/334 * 16.79)) <span style="color: #204A87;"># </span><span style="color: #204A87;">20.7% PVE Stn292</span>
summary(out.hk, perms=perm.hk, alpha=.05, format=<span style="color: #4E9A06;">"tabByCol"</span>, pvalues=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Plot scanone results on chromosome 4</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">plot(out.hk, lodcolumn=i[2], chr=4, show.marker.names=TRUE, col="red", ylab="LOD")</span>
plot(out.hk, lodcolumn=i[2], chr=4, col=<span style="color: #4E9A06;">"red"</span>, ylab=<span style="color: #4E9A06;">"LOD"</span>)
plot(out.hk, lodcolumn=i[1], chr=4, col=<span style="color: #4E9A06;">"blue"</span>, add=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
plot(out.hk, lodcolumn=i[3], chr=4, col=<span style="color: #4E9A06;">"green"</span>, add=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
plot(out.hk, lodcolumn=i[4], chr=4, col=<span style="color: #4E9A06;">"orange"</span>, add=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
add.threshold(out.hk, perms=perm.hk, alpha=0.05, lodcolumn=i[1], lty=4)
legend(8, 26, c(<span style="color: #4E9A06;">"DS1"</span>, <span style="color: #4E9A06;">"DS2"</span>, <span style="color: #4E9A06;">"DS3"</span>, <span style="color: #4E9A06;">"AS"</span>), fill=c(<span style="color: #4E9A06;">"blue"</span>,<span style="color: #4E9A06;">"red"</span>,<span style="color: #4E9A06;">"green"</span>,<span style="color: #4E9A06;">"orange"</span>), bty=<span style="color: #4E9A06;">"n"</span>)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Plot scanone results across entire genome</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">(linkage groups 1 through 21)</span>
pdf(<span style="color: #4E9A06;">"plots/spine_qtl_plot.pdf"</span>, width=8, height=3.5)
pcolors <span style="color: #F5666D;">&lt;-</span> c(<span style="color: #4E9A06;">"royalblue"</span>,<span style="color: #4E9A06;">"indianred2"</span>,<span style="color: #4E9A06;">"darkseagreen"</span>,<span style="color: #4E9A06;">"gold2"</span>)
par.old <span style="color: #F5666D;">&lt;-</span> par(mar=c(4,4,1.8,1), mgp=c(2.4,.8,0))
plot(out.hk, lodcolumn=i[2], chr=1:21, col=pcolors[2], ylab=<span style="color: #4E9A06;">"LOD"</span>, alternate.chrid=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>, bty=<span style="color: #4E9A06;">"l"</span>)
plot(out.hk, lodcolumn=i[1], chr=1:21, col=pcolors[1], add=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
plot(out.hk, lodcolumn=i[3], chr=1:21, col=pcolors[3], add=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
plot(out.hk, lodcolumn=i[4], chr=1:21, col=pcolors[4], add=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
add.threshold(out.hk, perms=perm.hk, alpha=0.05, lodcolumn=i[1], lty=4)
legend(40, 26, c(<span style="color: #4E9A06;">"DS1"</span>, <span style="color: #4E9A06;">"DS2"</span>, <span style="color: #4E9A06;">"DS3"</span>, <span style="color: #4E9A06;">"AS"</span>), fill=pcolors, bty=<span style="color: #4E9A06;">"n"</span>)
par(par.old)
dev.off()


<span style="color: #204A87;">## </span><span style="color: #204A87;">Run scantwo on selected phenotypes</span>
np <span style="color: #F5666D;">&lt;-</span> 10000  <span style="color: #204A87;"># </span><span style="color: #204A87;">10000 perms took 6.5 hours on 40 cores; 1000 perms may be adequate</span>
nc <span style="color: #F5666D;">&lt;-</span> 40
i <span style="color: #F5666D;">&lt;-</span> match(c(<span style="color: #4E9A06;">"Spine_1_rsd1"</span>,<span style="color: #4E9A06;">"Spine_2_rsd1"</span>,<span style="color: #4E9A06;">"Spine_3_rsd2"</span>,<span style="color: #4E9A06;">"Anal_Spine_rsd2"</span>), names(cross$pheno)[p])
out2.hk <span style="color: #F5666D;">&lt;-</span> scantwo(cross, pheno.col=p[i], model=<span style="color: #4E9A06;">"normal"</span>, method=<span style="color: #4E9A06;">"hk"</span>)

load(<span style="color: #4E9A06;">"data/scantwo.permutations.RData"</span>)  <span style="color: #204A87;"># </span><span style="color: #204A87;">load precalculated scantwo permutations</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Uncomment here to re-run the scantwo permutations</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">perm2.hk &lt;- scantwo(cross, pheno.col=p[i], model="normal", method="hk",</span>
<span style="color: #204A87;">#                     </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Determine penalties for stepwise analysis</span>
pen <span style="color: #F5666D;">&lt;-</span> calc.penalties(perm2.hk, alpha=.05)
pen.avg <span style="color: #F5666D;">&lt;-</span> apply(pen, 2, mean)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Stepwise model selection</span>
j <span style="color: #F5666D;">&lt;-</span> match(c(<span style="color: #4E9A06;">"Spine_1_rsd1"</span>,<span style="color: #4E9A06;">"Spine_2_rsd1"</span>,<span style="color: #4E9A06;">"Spine_3_rsd2"</span>,<span style="color: #4E9A06;">"Anal_Spine_rsd2"</span>), names(cross$pheno)[p])
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> 1:length(j)){
    stepout.a <span style="color: #F5666D;">&lt;-</span> stepwiseqtl(cross, additive.only=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>, max.qtl=10, method=<span style="color: #4E9A06;">"hk"</span>,
                             pheno.col=p[j[i]], penalties=pen[i,])
    <span style="color: #A52A2A; font-weight: bold;">if</span>(i==1){stp.1 <span style="color: #F5666D;">&lt;-</span> stepout.a}
    <span style="color: #A52A2A; font-weight: bold;">if</span>(i==2){stp.2 <span style="color: #F5666D;">&lt;-</span> stepout.a}
    <span style="color: #A52A2A; font-weight: bold;">if</span>(i==3){stp.3 <span style="color: #F5666D;">&lt;-</span> stepout.a}
    <span style="color: #A52A2A; font-weight: bold;">if</span>(i==4){stp.4 <span style="color: #F5666D;">&lt;-</span> stepout.a}
    print(names(cross$pheno)[p[j[i]]])
    print(stepout.a)
    print(summary(fitqtl(cross, pheno.col=p[j[i]], qtl=stepout.a, method=<span style="color: #4E9A06;">"hk"</span>)))

    <span style="color: #204A87;">##  </span><span style="color: #204A87;">No interactions were retained during model selection</span>
    <span style="color: #204A87;">#</span><span style="color: #204A87;">stepout.i &lt;- stepwiseqtl(cross, max.qtl=10, method="hk",</span>
    <span style="color: #204A87;">#                     </span><span style="color: #204A87;">pheno.col=p[j[i]], penalties=pen[i,])</span>
    <span style="color: #204A87;">#</span><span style="color: #204A87;">print(stepout.i)</span>
    <span style="color: #204A87;">#</span><span style="color: #204A87;">print(summary(fitqtl(cross, pheno.col=p[j[i]], qtl=stepout.i, method="hk",</span>
    <span style="color: #204A87;">#                     </span><span style="color: #204A87;">formula=attributes(stepout.i)$formula)))</span>
}

<span style="color: #204A87;">## </span><span style="color: #204A87;">Saved model selection output to data/stepwise_model_selection_output.txt</span>



<span style="color: #204A87;">## </span><span style="color: #204A87;">Use effectplot to get phenotype means for each genotype</span>
cross <span style="color: #F5666D;">&lt;-</span> sim.geno(cross, n.draws=64, map.function=<span style="color: #4E9A06;">"kosambi"</span>)
find.marker(cross, chr=4, pos=61.4)
find.marker(cross, chr=7, pos=85.8)
find.marker(cross, chr=16, pos=13.5)
print(effectplot(cross, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"Stn47"</span>))
print(effectplot(cross, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"Stn82"</span>))
print(effectplot(cross, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"Stn175"</span>))
find.marker(cross, chr=4, pos=55.3)
find.marker(cross, chr=8, pos=42)
find.marker(cross, chr=9, pos=8.7)
find.marker(cross, chr=16, pos=13.5)
print(effectplot(cross, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"Stn45"</span>))
print(effectplot(cross, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"Stn87"</span>))
print(effectplot(cross, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"Stn108"</span>))
print(effectplot(cross, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"Stn175"</span>))
find.marker(cross, chr=4, pos=55.0)
find.marker(cross, chr=13, pos=4.8)
find.marker(cross, chr=21, pos=0)
print(effectplot(cross, pheno.col=p[j[3]], mname1=<span style="color: #4E9A06;">"Gac4174"</span>))
print(effectplot(cross, pheno.col=p[j[3]], mname1=<span style="color: #4E9A06;">"Stn149"</span>))
print(effectplot(cross, pheno.col=p[j[3]], mname1=<span style="color: #4E9A06;">"Stn218"</span>))
find.marker(cross, chr=4, pos=63.5)
find.marker(cross, chr=17, pos=45.8)
find.marker(cross, chr=20, pos=0)
print(effectplot(cross, pheno.col=p[j[4]], mname1=<span style="color: #4E9A06;">"Stn292"</span>))
print(effectplot(cross, pheno.col=p[j[4]], mname1=<span style="color: #4E9A06;">"Stn273"</span>))
print(effectplot(cross, pheno.col=p[j[4]], mname1=<span style="color: #4E9A06;">"Stn213"</span>))


<span style="color: #204A87;">## </span><span style="color: #204A87;">Build a table of phenotype means per genotype at QTL</span>
ptable <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"Stn47"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> as.data.frame(t(ptable))
names(ptable) <span style="color: #F5666D;">&lt;-</span> c(<span style="color: #4E9A06;">"M2F1"</span>,<span style="color: #4E9A06;">"M1M2"</span>,<span style="color: #4E9A06;">"F1F2"</span>,<span style="color: #4E9A06;">"M1F2"</span>)
ptable <span style="color: #F5666D;">&lt;-</span> ptable[,c(<span style="color: #4E9A06;">"M1M2"</span>,<span style="color: #4E9A06;">"M2F1"</span>,<span style="color: #4E9A06;">"M1F2"</span>,<span style="color: #4E9A06;">"F1F2"</span>)]
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"Stn82"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp[c(3,4,1,2)] )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"Stn175"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"Stn45"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp[c(2,1,4,3)] )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"Stn87"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp[c(3,4,1,2)] )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"Stn108"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"Stn175"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[3]], mname1=<span style="color: #4E9A06;">"Gac4174"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp[c(2,1,4,3)] )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[3]], mname1=<span style="color: #4E9A06;">"Stn149"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp[c(4,3,2,1)] )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[3]], mname1=<span style="color: #4E9A06;">"Stn218"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp[c(3,4,1,2)] )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[4]], mname1=<span style="color: #4E9A06;">"Stn292"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp[c(2,1,4,3)] )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[4]], mname1=<span style="color: #4E9A06;">"Stn273"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp[c(3,4,1,2)] )
tmp <span style="color: #F5666D;">&lt;-</span> effectplot(cross, pheno.col=p[j[4]], mname1=<span style="color: #4E9A06;">"Stn213"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> rbind( ptable, tmp )


<span style="color: #204A87;">## </span><span style="color: #204A87;">LOD scores for dropping one QTL at a time from each model</span>
qtable1 <span style="color: #F5666D;">&lt;-</span> summary(fitqtl(cross, pheno.col=p[j[1]], qtl=stp.1, method=<span style="color: #4E9A06;">"hk"</span>))$result.drop[,]
qtable2 <span style="color: #F5666D;">&lt;-</span> summary(fitqtl(cross, pheno.col=p[j[2]], qtl=stp.2, method=<span style="color: #4E9A06;">"hk"</span>))$result.drop[,]
qtable3 <span style="color: #F5666D;">&lt;-</span> summary(fitqtl(cross, pheno.col=p[j[3]], qtl=stp.3, method=<span style="color: #4E9A06;">"hk"</span>))$result.drop[,]
qtable4 <span style="color: #F5666D;">&lt;-</span> summary(fitqtl(cross, pheno.col=p[j[4]], qtl=stp.4, method=<span style="color: #4E9A06;">"hk"</span>))$result.drop[,]
qtable1 <span style="color: #F5666D;">&lt;-</span> as.data.frame(qtable1)
qtable2 <span style="color: #F5666D;">&lt;-</span> as.data.frame(qtable2)
qtable3 <span style="color: #F5666D;">&lt;-</span> as.data.frame(qtable3)
qtable4 <span style="color: #F5666D;">&lt;-</span> as.data.frame(qtable4)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Combine phenotype means, LOD scores and PVE into a table</span>
markers <span style="color: #F5666D;">&lt;-</span> c(<span style="color: #4E9A06;">"Stn47"</span>,<span style="color: #4E9A06;">"Stn82"</span>,<span style="color: #4E9A06;">"Stn175"</span>,<span style="color: #4E9A06;">"Stn45"</span>,<span style="color: #4E9A06;">"Stn87"</span>,<span style="color: #4E9A06;">"Stn108"</span>,<span style="color: #4E9A06;">"Stn175"</span>,<span style="color: #4E9A06;">"Gac4174"</span>,<span style="color: #4E9A06;">"Stn149"</span>,
             <span style="color: #4E9A06;">"Stn218"</span>,<span style="color: #4E9A06;">"Stn292"</span>, <span style="color: #4E9A06;">"Stn273"</span>, <span style="color: #4E9A06;">"Stn213"</span>)
etable <span style="color: #F5666D;">&lt;-</span> data.frame(Trait=c(rep(<span style="color: #4E9A06;">"DS1"</span>,3),rep(<span style="color: #4E9A06;">"DS2"</span>,4),rep(<span style="color: #4E9A06;">"DS3"</span>,3),rep(<span style="color: #4E9A06;">"AS"</span>,3)),
                     Chromosome=c(4, 7, 16, 4, 8, 9, 16, 4, 13, 21, 4, 17, 20),
                     Position=c(floor(stp.1$pos*10)/10,floor(stp.2$pos*10)/10,
                                floor(stp.3$pos*10)/10,floor(stp.4$pos*10)/10),
                     Marker=markers, LOD=c(qtable1$LOD,qtable2$LOD,qtable3$LOD,qtable4$LOD),
                     PVE=c(qtable1[,<span style="color: #4E9A06;">"%var"</span>],qtable2[,<span style="color: #4E9A06;">"%var"</span>],qtable3[,<span style="color: #4E9A06;">"%var"</span>],qtable4[,<span style="color: #4E9A06;">"%var"</span>]))
ptable <span style="color: #F5666D;">&lt;-</span> cbind(etable, ptable)
print(ptable)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Generate LaTeX table</span>
<span style="color: #F5666D;">library</span>(xtable)
print(xtable(ptable, rownames=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>), include.rownames=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
</pre>
</div>
</div>
</div>
</div>
