QTL_mapping.org
* Fine mapping across all families for chromosome 4 region of interest

QTL analysis - fine mapping on chromosome 4 as a combined F2 cross

Use simplified marine/freshwater genotypes to combine information across
families, and treat it as a single F2 intercross.

Include family of origin along with Standard Length and Sex in the choices for
phenotype models to calculate residuals.

#+BEGIN_SRC R

  ## Load Spine 1 and Spine 2 phenotypes from multiple families
  pheno <- read.csv("data/fine_mapping_phenotypes.csv", stringsAsFactors=FALSE)

  ## Load genotype data for fine mapping region
  ## Coded as A, B, H for marine, freshwater, heterozygous genotypes
  geno <- read.csv("data/fine_mapping_genotypes.csv", stringsAsFactors=FALSE)


  ## Remove redundant, uninformative markers from genotypes
  geno <- geno[, -match(c("mem141","mem140","mem007","mem139","mem228","mem229",
                      "mem238","mem241","mem296","mem297","BRSm019"), names(geno))]

  ## Combine genotype and phenotype data
  geno <- cbind(geno[,"Fish"], pheno[,"Family"], pheno[,3:8], geno[,2:dim(geno)[2]], stringsAsFactors=FALSE)
  names(geno)[1:2] <- c("Fish", "Family")


  ## Write cross file in F2 intercross format for R/qtl
  ## Replace, A,H,B genotypes with 1,2,3
  x <- geno[ , 9:dim(geno)[2] ]
  x[ x == "-" ] <- NA
  x[ x == "A" ] <- 1
  x[ x == "H" ] <- 2
  x[ x == "B" ] <- 3
  geno[ , 9:dim(geno)[2] ] <- x
  x <- rbind( names(geno), c(rep("",8), rep("4", dim(x)[2])), geno, stringsAsFactors=FALSE)
  write.table(x, "data/cross_fm.csv", col.names=FALSE, row.names=FALSE, sep=",", quote=FALSE)


  ## Read cross as F2 intercross in R/qtl
  library(qtl)
  ## est.map uses Lander-Green algorithm with Haldane map function by default
  cross.fm <- read.cross(format="csv", file="data/cross_fm.csv", estimate.map=TRUE, genotypes=NULL)
  cross.fm <- calc.genoprob(cross.fm, step=0, error.prob=0.0001)
  cross.fm$pheno$Fish <- as.character(cross.fm$pheno$Fish)
  cross.fm$pheno$Family <- as.factor(cross.fm$pheno$Family)
  sapply(cross.fm$pheno, class)
  summary(cross.fm)



  ## Calculate residuals to standard length and/or sex
  ## Also consider family as a variable
  ## Store all the residuals resultning from all models
  for(i in c(6:8)){
      p <- cross.fm$pheno[, c(1:5, i)]
      names(p)[6] <- "trait"
      m1 <- lm( trait ~ SL, data=p)
      m2 <- lm( trait ~ SL + Sex, data=p)
      m3 <- lm( trait ~ Sex, data=p)
      m4 <- lm( trait ~ Family, data=p)
      m5 <- lm( trait ~ Family + SL, data=p)
      m6 <- lm( trait ~ Family + SL + Sex, data=p)
      m7 <- lm( trait ~ Family + Sex, data=p)
      m <- list(m1,m2,m3,m4,m5,m6,m7)
      p.val <- as.vector(sapply(m, function(x){
          pf(summary(x)$fstatistic["value"],
             summary(x)$fstatistic["numdf"],
             summary(x)$fstatistic["dendf"],
             lower.tail=FALSE)}))
      print(p.val)
      j <- as.integer(which( p.val == min(p.val) ))
      if( min(p.val) > 0.01 ){ print("WARNING: P > 0.01"); print(c(i,j)) }
      if( length(j) > 1 ){
          print("WARNING: TIE FOR BEST MODEL")
          print(c(i,j))
          j <- j[1]
      }
      k <- list(!is.na(cross.fm$pheno[,i]) & !is.na(cross.fm$pheno$SL),
                !is.na(cross.fm$pheno[,i]) & !is.na(cross.fm$pheno$SL) & !is.na(cross.fm$pheno$Sex),
                !is.na(cross.fm$pheno[,i]) & !is.na(cross.fm$pheno$Sex),
                !is.na(cross.fm$pheno[,i]) & !is.na(cross.fm$pheno$Family),
                !is.na(cross.fm$pheno[,i]) & !is.na(cross.fm$pheno$Family) & !is.na(cross.fm$pheno$SL),
                !is.na(cross.fm$pheno[,i]) & !is.na(cross.fm$pheno$Family) & !is.na(cross.fm$pheno$SL) & !is.na(cross.fm$pheno$Sex),
                !is.na(cross.fm$pheno[,i]) & !is.na(cross.fm$pheno$Family) & !is.na(cross.fm$pheno$Sex))
      for(j in 1:7){cross.fm$pheno[k[[j]],paste0(names(cross.fm$pheno)[i],"_rsd",j)] <- residuals(m[[j]])}
  }


  ## Also consider binary presence/absence phenotypes
  cross.fm$pheno$Spine1.present <- as.numeric(!is.na(cross.fm$pheno$Spine_1))
  cross.fm$pheno$Spine2.present <- as.numeric(!is.na(cross.fm$pheno$Spine_2))
  cross.fm$pheno$Spine1.present[ is.na(cross.fm$pheno$Spine_1) & is.na(cross.fm$pheno$Spine_2) ] <- NA
  cross.fm$pheno$Spine2.present[ is.na(cross.fm$pheno$Spine_1) & is.na(cross.fm$pheno$Spine_2) ] <- NA


  ## Select phenotypes to analyze
  ## (focus on Spine 1 and Spine 2, residuals to standard length)
  p <- match(c("Spine_1", "Spine_2", "Spine_1_rsd1", "Spine_2_rsd1"), names(cross.fm$pheno))
  #cross.fm$pheno$sex.numeric <- as.numeric(cross.fm$pheno$Sex) - 1
  #p.bin <- 30:32
  #p.2p <- 7


  ## Run scanone using hk,em for normal traits and em for binary traits
  np <- 10000 # number of permutations for permutation test
  nc <- 8     # number of cores to use (make sure np divisible by nc)
  fine.hk <- scanone(cross.fm, pheno.col=p, model="normal", method="hk")
  fine.em <- scanone(cross.fm, pheno.col=p, model="normal", method="em")

  ## load precalculated fine.perm.hk and fine.perm.em permutations
  load("data/fine_mapping.scanone.permutations.RData")
  ## uncommment to re-run
  #fine.perm.hk <- scanone(cross.fm, pheno.col=p, model="normal", method="hk",
  #                        n.perm=np, n.cluster=nc)
  #fine.perm.em <- scanone(cross.fm, pheno.col=p, model="normal", method="em",
  #                        n.perm=np, n.cluster=nc)

  ## uncomment if running additional binary or 2part traits
  #fine.bin.em <- scanone(cross.fm, pheno.col=p.bin, model="binary", method="em")
  #fine.2p.em <- scanone(cross.fm, pheno.col=p.2p, model="2part", method="em")
  #fine.perm.bin.em <- scanone(cross.fm, pheno.col=p.bin, model="binary", method="em",
  #                         n.perm=np, n.cluster=nc)
  #fine.perm.2p.em <- scanone(cross.fm, pheno.col=p.bin, model="2part", method="em",
  #                         n.perm=np, n.cluster=nc)


  ## Generate plots of scanone results
  for(i in seq_along(p)){
      png(paste0("plots/fine_mapping_normal_hk_",formatC(p[i], width=2, flag="0"),".png"), 1200, 400)
      plot(fine.hk, lodcolumn=i)
      add.threshold(fine.hk, perms=fine.perm.hk, alpha=0.05, lodcolumn=i, lty=4)
      dev.off()
  }
  for(i in seq_along(p)){
      png(paste0("plots/fine_mapping_normal_em_",formatC(p[i], width=2, flag="0"),".png"), 1200, 400)
      plot(fine.em, lodcolumn=i)
      #plot(fine.em, lodcolumn=i, ylim=c(40,80), xlim=c(7,15))
      add.threshold(fine.em, perms=fine.perm.em, alpha=0.05, lodcolumn=i, lty=4)
      dev.off()
  }



  ## Display scanone results
  i <- match(c("Spine_1_rsd1","Spine_2_rsd1"), names(cross.fm$pheno)[p])
  summary(fine.hk, perms=fine.perm.hk, alpha=.05, lodcolumn=i[1])[,c(1:2,i+2)]
  summary(fine.hk, perms=fine.perm.hk, alpha=.05, lodcolumn=i[2])[,c(1:2,i+2)]
  summary(fine.hk, perms=fine.perm.hk, format="tabByCol", pvalues=TRUE,
          ci.function="lodint", drop=1)

  ## 1-LOD intervals from QTL peak
  lodint(fine.hk, chr=4, drop=1, lodcolumn=i[1]) # mem006 to mem253
  sum(!is.na(cross.fm$pheno$Spine_1_rsd1))
  print(1-10^(-2/912 * 61.34))    # 26.6% PVE
  lodint(fine.hk, chr=4, drop=1, lodcolumn=i[2]) # mem006 to mem253
  sum(!is.na(cross.fm$pheno$Spine_2_rsd1))
  print(1-10^(-2/936 * 73.16))    # 30.2% PVE

  ## Bayesian credible interval, prob=0.95
  bayesint(fine.hk, chr=4, lodcolumn=i[1]) # Stn365 to mem244
  bayesint(fine.hk, chr=4, lodcolumn=i[2]) # Stn365 to mem244


  ## Generate plot of LOD scores for Spine 1 and Spine 2 residuals
  pdf("plots/fine_mapping_lod_plot.pdf", family="Helvetica", width=8, height=3.5)
  pcolors <- c("royalblue","indianred2","darkseagreen","gold2")
  par.old <- par(mar=c(4,4,1.8,1), mgp=c(2.4,.8,0))
  plot(fine.hk, lodcolumn=i[2], col=pcolors[2], ylab="LOD", ylim=c(35,75), bty="l",
       xlab="", incl.markers=FALSE)
       #xlab=paste0("Map position (cM)", paste(rep(" ", 50), collapse="")))
  rug(unlist(pull.map(cross.fm), use.names=FALSE), 0.06, lwd=1.5, quiet=TRUE)
  plot(fine.hk, lodcolumn=i[1], col=pcolors[1], add=TRUE)
  add.threshold(fine.hk, perms=fine.perm.hk, alpha=0.05, lodcolumn=i[1], lty=4)
  legend(-.1, 70, c("DS1", "DS2"), fill=pcolors, bty="n")
  par(par.old)
  dev.off()


  ## 2002 individuals, 37 markers
  dim(cross.fm$geno[[1]]$data)
  ## Genotypes per marker
  apply(cross.fm$geno[[1]]$data, 2, function(x){ sum(!is.na(x))})
  ## Individuals per family
  table(cross.fm$pheno$Family)



  ## Run scantwo on selected phenotypes
  np <- 10000 # number of permutations for permutation test
  nc <- 8     # number of cores to use (make sure np divisible by nc)
  j <- match(c("Spine_1_rsd1","Spine_2_rsd1"), names(cross.fm$pheno)[p])
  fine2.hk <- scantwo(cross.fm, pheno.col=p[j], model="normal", method="hk")
  load("data/fine_mapping.scantwo.permutations.RData") # load precalculated permutations
  ## Uncomment to re-run permutations
  #fine2.perm.hk <- scantwo(cross.fm, pheno.col=p[j], model="normal", method="hk",
  #                       n.perm=np, n.cluster=nc)
  summary(fine2.perm.hk)
  plot(fine2.perm.hk, lodcolumn=1)
  plot(fine2.perm.hk, lodcolumn=2)
  summary(fine2.hk, perms=fine2.perm.hk, alphas=.05, lodcolumn=1, pvalues=TRUE)
  summary(fine2.hk, perms=fine2.perm.hk, alphas=.05, lodcolumn=2, pvalues=TRUE)
  ## For spine 1, an additive model combining mem235 and BRSm018 is supported
  find.marker(cross.fm, chr=4, pos=9.3)
  find.marker(cross.fm, chr=4, pos=13.2)
  pen <- calc.penalties(fine2.perm.hk, alpha=.05)
  pen.avg <- apply(pen, 2, mean)

  ## Stepwise model selection
  for(i in 1:length(j)){
      stp.a <- stepwiseqtl(cross.fm, additive.only=TRUE, max.qtl=2, method="hk",
                           pheno.col=p[j[i]], penalties=pen[i,])
      if(i==1){ stp.fm.1 <- stp.a }
      if(i==2){ stp.fm.2 <- stp.a }
      print(names(cross.fm$pheno)[p[j[i]]])
      print(stp.a)
      print(summary(fitqtl(cross.fm, pheno.col=p[j[i]], qtl=stp.a, method="hk")))
      #stp.i <- stepwiseqtl(cross.fm, max.qtl=2, method="hk",
      #                     pheno.col=p[j[i]], penalties=pen[i,])
      #print(stp.i)
      #print(summary(fitqtl(cross.fm, pheno.col=p[j[i]], qtl=stp.i, method="hk",
      #                     formula=attributes(stp.i)$formula)))
  }

  ## Again, an additive model combining mem235 and BRSm018 is chosen for spine 1
  ## Results save as data/fine_mapping_stepwise_model_selection_output.txt


  ## Phenotype effects
  cross.fm <- sim.geno(cross.fm, n.draws=64)
  print(effectplot(cross.fm, pheno.col=p[j[1]], mname1="mem235"))
  print(effectplot(cross.fm, pheno.col=p[j[2]], mname1="mem235"))
  ptable <- effectplot(cross.fm, pheno.col=p[j[1]], mname1="mem235")$Means
  ptable <- as.data.frame(t(ptable))
  ptable <- rbind(ptable, effectplot(cross.fm, pheno.col=p[j[1]], mname1="BRSm018")$Means)
  ptable <- rbind(ptable, effectplot(cross.fm, pheno.col=p[j[2]], mname1="mem235")$Means)

  qtable1 <- summary(fitqtl(cross.fm, pheno.col=p[j[1]], qtl=stp.fm.1, method="hk"))$result.drop[,]
  qtable2 <- summary(fitqtl(cross.fm, pheno.col=p[j[2]], qtl=stp.fm.2, method="hk"))$result.full
  qtable1 <- as.data.frame(qtable1)
  qtable2 <- as.data.frame(qtable2)

  find.marker(cross.fm, chr=4, pos=13.2)
  etable <- data.frame(Trait=c("DS1","DS1","DS2"), Position=c("9.3 cM","13.2 cM","9.3 cM"),
                       Marker=c("mem235","BRSm018","mem235"), LOD=c(qtable1$LOD,qtable2$LOD[1]),
                       PVE=c(qtable1[,"%var"],qtable2[1,"%var"]))
  ptable <- cbind(etable, ptable)
  print(ptable)

  ## Generate LaTeX table
  library(xtable)
  print(xtable(ptable, rownames=FALSE), include.rownames=FALSE)


  ## LOD intervals
  lodint(stp.fm.1, 4, qtl.index=1, drop=1)
  lodint(stp.fm.1, 4, qtl.index=1, drop=.001)
  bayesint(stp.fm.1, 4, qtl.index=1, prob=.9)
  lodint(stp.fm.1, 4, qtl.index=2, drop=1)
  lodint(stp.fm.1, 4, qtl.index=2, drop=.001)
  bayesint(stp.fm.1, 4, qtl.index=2, prob=.9)
  lodint(stp.fm.2, 4, drop=1)
  lodint(stp.fm.2, 4, drop=.001)
  bayesint(stp.fm.2, 4, prob=.9)

#+END_SRC
