QTL_mapping.html




<div id="outline-container-orge34ceca" class="outline-2">
<h2 id="orge34ceca">Fine mapping across all families for chromosome 4 region of interest</h2>
<div class="outline-text-2" id="text-orge34ceca">
<p>
QTL analysis - fine mapping on chromosome 4 as a combined F2 cross
</p>

<p>
Use simplified marine/freshwater genotypes to combine information across
families, and treat it as a single F2 intercross.
</p>

<p>
Include family of origin along with Standard Length and Sex in the choices for
phenotype models to calculate residuals.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #204A87;">## </span><span style="color: #204A87;">Load Spine 1 and Spine 2 phenotypes from multiple families</span>
pheno <span style="color: #F5666D;">&lt;-</span> read.csv(<span style="color: #4E9A06;">"data/fine_mapping_phenotypes.csv"</span>, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)

<span style="color: #204A87;">## </span><span style="color: #204A87;">Load genotype data for fine mapping region</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Coded as A, B, H for marine, freshwater, heterozygous genotypes</span>
geno <span style="color: #F5666D;">&lt;-</span> read.csv(<span style="color: #4E9A06;">"data/fine_mapping_genotypes.csv"</span>, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Remove redundant, uninformative markers from genotypes</span>
geno <span style="color: #F5666D;">&lt;-</span> geno[, -match(c(<span style="color: #4E9A06;">"mem141"</span>,<span style="color: #4E9A06;">"mem140"</span>,<span style="color: #4E9A06;">"mem007"</span>,<span style="color: #4E9A06;">"mem139"</span>,<span style="color: #4E9A06;">"mem228"</span>,<span style="color: #4E9A06;">"mem229"</span>,
                    <span style="color: #4E9A06;">"mem238"</span>,<span style="color: #4E9A06;">"mem241"</span>,<span style="color: #4E9A06;">"mem296"</span>,<span style="color: #4E9A06;">"mem297"</span>,<span style="color: #4E9A06;">"BRSm019"</span>), names(geno))]

<span style="color: #204A87;">## </span><span style="color: #204A87;">Combine genotype and phenotype data</span>
geno <span style="color: #F5666D;">&lt;-</span> cbind(geno[,<span style="color: #4E9A06;">"Fish"</span>], pheno[,<span style="color: #4E9A06;">"Family"</span>], pheno[,3:8], geno[,2:dim(geno)[2]], stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
names(geno)[1:2] <span style="color: #F5666D;">&lt;-</span> c(<span style="color: #4E9A06;">"Fish"</span>, <span style="color: #4E9A06;">"Family"</span>)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Write cross file in F2 intercross format for R/qtl</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Replace, A,H,B genotypes with 1,2,3</span>
x <span style="color: #F5666D;">&lt;-</span> geno[ , 9:dim(geno)[2] ]
x[ x == <span style="color: #4E9A06;">"-"</span> ] <span style="color: #F5666D;">&lt;-</span> <span style="color: #2F8B58; font-weight: bold;">NA</span>
x[ x == <span style="color: #4E9A06;">"A"</span> ] <span style="color: #F5666D;">&lt;-</span> 1
x[ x == <span style="color: #4E9A06;">"H"</span> ] <span style="color: #F5666D;">&lt;-</span> 2
x[ x == <span style="color: #4E9A06;">"B"</span> ] <span style="color: #F5666D;">&lt;-</span> 3
geno[ , 9:dim(geno)[2] ] <span style="color: #F5666D;">&lt;-</span> x
x <span style="color: #F5666D;">&lt;-</span> rbind( names(geno), c(rep(<span style="color: #4E9A06;">""</span>,8), rep(<span style="color: #4E9A06;">"4"</span>, dim(x)[2])), geno, stringsAsFactors=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
write.table(x, <span style="color: #4E9A06;">"data/cross_fm.csv"</span>, col.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, row.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>, sep=<span style="color: #4E9A06;">","</span>, quote=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)


<span style="color: #204A87;">## </span><span style="color: #204A87;">Read cross as F2 intercross in R/qtl</span>
<span style="color: #F5666D;">library</span>(qtl)
<span style="color: #204A87;">## </span><span style="color: #204A87;">est.map uses Lander-Green algorithm with Haldane map function by default</span>
cross.fm <span style="color: #F5666D;">&lt;-</span> read.cross(format=<span style="color: #4E9A06;">"csv"</span>, file=<span style="color: #4E9A06;">"data/cross_fm.csv"</span>, estimate.map=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>, genotypes=<span style="color: #2F8B58; font-weight: bold;">NULL</span>)
cross.fm <span style="color: #F5666D;">&lt;-</span> calc.genoprob(cross.fm, step=0, error.prob=0.0001)
cross.fm$pheno$Fish <span style="color: #F5666D;">&lt;-</span> as.character(cross.fm$pheno$Fish)
cross.fm$pheno$Family <span style="color: #F5666D;">&lt;-</span> as.factor(cross.fm$pheno$Family)
sapply(cross.fm$pheno, class)
summary(cross.fm)



<span style="color: #204A87;">## </span><span style="color: #204A87;">Calculate residuals to standard length and/or sex</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Also consider family as a variable</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Store all the residuals resultning from all models</span>
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> c(6:8)){
    p <span style="color: #F5666D;">&lt;-</span> cross.fm$pheno[, c(1:5, i)]
    names(p)[6] <span style="color: #F5666D;">&lt;-</span> <span style="color: #4E9A06;">"trait"</span>
    m1 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ SL, data=p)
    m2 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ SL + Sex, data=p)
    m3 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ Sex, data=p)
    m4 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ Family, data=p)
    m5 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ Family + SL, data=p)
    m6 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ Family + SL + Sex, data=p)
    m7 <span style="color: #F5666D;">&lt;-</span> lm( trait ~ Family + Sex, data=p)
    m <span style="color: #F5666D;">&lt;-</span> list(m1,m2,m3,m4,m5,m6,m7)
    p.val <span style="color: #F5666D;">&lt;-</span> as.vector(sapply(m, <span style="color: #A52A2A; font-weight: bold;">function</span>(x){
        pf(summary(x)$fstatistic[<span style="color: #4E9A06;">"value"</span>],
           summary(x)$fstatistic[<span style="color: #4E9A06;">"numdf"</span>],
           summary(x)$fstatistic[<span style="color: #4E9A06;">"dendf"</span>],
           lower.tail=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)}))
    print(p.val)
    j <span style="color: #F5666D;">&lt;-</span> as.integer(which( p.val == min(p.val) ))
    <span style="color: #A52A2A; font-weight: bold;">if</span>( min(p.val) &gt; 0.01 ){ print(<span style="color: #4E9A06;">"WARNING: P &gt; 0.01"</span>); print(c(i,j)) }
    <span style="color: #A52A2A; font-weight: bold;">if</span>( length(j) &gt; 1 ){
        print(<span style="color: #4E9A06;">"WARNING: TIE FOR BEST MODEL"</span>)
        print(c(i,j))
        j <span style="color: #F5666D;">&lt;-</span> j[1]
    }
    k <span style="color: #F5666D;">&lt;-</span> list(!is.na(cross.fm$pheno[,i]) &amp; !is.na(cross.fm$pheno$SL),
              !is.na(cross.fm$pheno[,i]) &amp; !is.na(cross.fm$pheno$SL) &amp; !is.na(cross.fm$pheno$Sex),
              !is.na(cross.fm$pheno[,i]) &amp; !is.na(cross.fm$pheno$Sex),
              !is.na(cross.fm$pheno[,i]) &amp; !is.na(cross.fm$pheno$Family),
              !is.na(cross.fm$pheno[,i]) &amp; !is.na(cross.fm$pheno$Family) &amp; !is.na(cross.fm$pheno$SL),
              !is.na(cross.fm$pheno[,i]) &amp; !is.na(cross.fm$pheno$Family) &amp; !is.na(cross.fm$pheno$SL) &amp; !is.na(cross.fm$pheno$Sex),
              !is.na(cross.fm$pheno[,i]) &amp; !is.na(cross.fm$pheno$Family) &amp; !is.na(cross.fm$pheno$Sex))
    <span style="color: #A52A2A; font-weight: bold;">for</span>(j <span style="color: #A52A2A; font-weight: bold;">in</span> 1:7){cross.fm$pheno[k[[j]],paste0(names(cross.fm$pheno)[i],<span style="color: #4E9A06;">"_rsd"</span>,j)] <span style="color: #F5666D;">&lt;-</span> residuals(m[[j]])}
}


<span style="color: #204A87;">## </span><span style="color: #204A87;">Also consider binary presence/absence phenotypes</span>
cross.fm$pheno$Spine1.present <span style="color: #F5666D;">&lt;-</span> as.numeric(!is.na(cross.fm$pheno$Spine_1))
cross.fm$pheno$Spine2.present <span style="color: #F5666D;">&lt;-</span> as.numeric(!is.na(cross.fm$pheno$Spine_2))
cross.fm$pheno$Spine1.present[ is.na(cross.fm$pheno$Spine_1) &amp; is.na(cross.fm$pheno$Spine_2) ] <span style="color: #F5666D;">&lt;-</span> <span style="color: #2F8B58; font-weight: bold;">NA</span>
cross.fm$pheno$Spine2.present[ is.na(cross.fm$pheno$Spine_1) &amp; is.na(cross.fm$pheno$Spine_2) ] <span style="color: #F5666D;">&lt;-</span> <span style="color: #2F8B58; font-weight: bold;">NA</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Select phenotypes to analyze</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">(focus on Spine 1 and Spine 2, residuals to standard length)</span>
p <span style="color: #F5666D;">&lt;-</span> match(c(<span style="color: #4E9A06;">"Spine_1"</span>, <span style="color: #4E9A06;">"Spine_2"</span>, <span style="color: #4E9A06;">"Spine_1_rsd1"</span>, <span style="color: #4E9A06;">"Spine_2_rsd1"</span>), names(cross.fm$pheno))
<span style="color: #204A87;">#</span><span style="color: #204A87;">cross.fm$pheno$sex.numeric &lt;- as.numeric(cross.fm$pheno$Sex) - 1</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">p.bin &lt;- 30:32</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">p.2p &lt;- 7</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Run scanone using hk,em for normal traits and em for binary traits</span>
np <span style="color: #F5666D;">&lt;-</span> 10000 <span style="color: #204A87;"># </span><span style="color: #204A87;">number of permutations for permutation test</span>
nc <span style="color: #F5666D;">&lt;-</span> 8     <span style="color: #204A87;"># </span><span style="color: #204A87;">number of cores to use (make sure np divisible by nc)</span>
fine.hk <span style="color: #F5666D;">&lt;-</span> scanone(cross.fm, pheno.col=p, model=<span style="color: #4E9A06;">"normal"</span>, method=<span style="color: #4E9A06;">"hk"</span>)
fine.em <span style="color: #F5666D;">&lt;-</span> scanone(cross.fm, pheno.col=p, model=<span style="color: #4E9A06;">"normal"</span>, method=<span style="color: #4E9A06;">"em"</span>)

<span style="color: #204A87;">## </span><span style="color: #204A87;">load precalculated fine.perm.hk and fine.perm.em permutations</span>
load(<span style="color: #4E9A06;">"data/fine_mapping.scanone.permutations.RData"</span>)
<span style="color: #204A87;">## </span><span style="color: #204A87;">uncommment to re-run</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">fine.perm.hk &lt;- scanone(cross.fm, pheno.col=p, model="normal", method="hk",</span>
<span style="color: #204A87;">#                        </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">fine.perm.em &lt;- scanone(cross.fm, pheno.col=p, model="normal", method="em",</span>
<span style="color: #204A87;">#                        </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>

<span style="color: #204A87;">## </span><span style="color: #204A87;">uncomment if running additional binary or 2part traits</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">fine.bin.em &lt;- scanone(cross.fm, pheno.col=p.bin, model="binary", method="em")</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">fine.2p.em &lt;- scanone(cross.fm, pheno.col=p.2p, model="2part", method="em")</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">fine.perm.bin.em &lt;- scanone(cross.fm, pheno.col=p.bin, model="binary", method="em",</span>
<span style="color: #204A87;">#                         </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">fine.perm.2p.em &lt;- scanone(cross.fm, pheno.col=p.bin, model="2part", method="em",</span>
<span style="color: #204A87;">#                         </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Generate plots of scanone results</span>
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> seq_along(p)){
    png(paste0(<span style="color: #4E9A06;">"plots/fine_mapping_normal_hk_"</span>,formatC(p[i], width=2, flag=<span style="color: #4E9A06;">"0"</span>),<span style="color: #4E9A06;">".png"</span>), 1200, 400)
    plot(fine.hk, lodcolumn=i)
    add.threshold(fine.hk, perms=fine.perm.hk, alpha=0.05, lodcolumn=i, lty=4)
    dev.off()
}
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> seq_along(p)){
    png(paste0(<span style="color: #4E9A06;">"plots/fine_mapping_normal_em_"</span>,formatC(p[i], width=2, flag=<span style="color: #4E9A06;">"0"</span>),<span style="color: #4E9A06;">".png"</span>), 1200, 400)
    plot(fine.em, lodcolumn=i)
    <span style="color: #204A87;">#</span><span style="color: #204A87;">plot(fine.em, lodcolumn=i, ylim=c(40,80), xlim=c(7,15))</span>
    add.threshold(fine.em, perms=fine.perm.em, alpha=0.05, lodcolumn=i, lty=4)
    dev.off()
}



<span style="color: #204A87;">## </span><span style="color: #204A87;">Display scanone results</span>
i <span style="color: #F5666D;">&lt;-</span> match(c(<span style="color: #4E9A06;">"Spine_1_rsd1"</span>,<span style="color: #4E9A06;">"Spine_2_rsd1"</span>), names(cross.fm$pheno)[p])
summary(fine.hk, perms=fine.perm.hk, alpha=.05, lodcolumn=i[1])[,c(1:2,i+2)]
summary(fine.hk, perms=fine.perm.hk, alpha=.05, lodcolumn=i[2])[,c(1:2,i+2)]
summary(fine.hk, perms=fine.perm.hk, format=<span style="color: #4E9A06;">"tabByCol"</span>, pvalues=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>,
        ci.function=<span style="color: #4E9A06;">"lodint"</span>, drop=1)

<span style="color: #204A87;">## </span><span style="color: #204A87;">1-LOD intervals from QTL peak</span>
lodint(fine.hk, chr=4, drop=1, lodcolumn=i[1]) <span style="color: #204A87;"># </span><span style="color: #204A87;">mem006 to mem253</span>
sum(!is.na(cross.fm$pheno$Spine_1_rsd1))
print(1-10^(-2/912 * 61.34))    <span style="color: #204A87;"># </span><span style="color: #204A87;">26.6% PVE</span>
lodint(fine.hk, chr=4, drop=1, lodcolumn=i[2]) <span style="color: #204A87;"># </span><span style="color: #204A87;">mem006 to mem253</span>
sum(!is.na(cross.fm$pheno$Spine_2_rsd1))
print(1-10^(-2/936 * 73.16))    <span style="color: #204A87;"># </span><span style="color: #204A87;">30.2% PVE</span>

<span style="color: #204A87;">## </span><span style="color: #204A87;">Bayesian credible interval, prob=0.95</span>
bayesint(fine.hk, chr=4, lodcolumn=i[1]) <span style="color: #204A87;"># </span><span style="color: #204A87;">Stn365 to mem244</span>
bayesint(fine.hk, chr=4, lodcolumn=i[2]) <span style="color: #204A87;"># </span><span style="color: #204A87;">Stn365 to mem244</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Generate plot of LOD scores for Spine 1 and Spine 2 residuals</span>
pdf(<span style="color: #4E9A06;">"plots/fine_mapping_lod_plot.pdf"</span>, family=<span style="color: #4E9A06;">"Helvetica"</span>, width=8, height=3.5)
pcolors <span style="color: #F5666D;">&lt;-</span> c(<span style="color: #4E9A06;">"royalblue"</span>,<span style="color: #4E9A06;">"indianred2"</span>,<span style="color: #4E9A06;">"darkseagreen"</span>,<span style="color: #4E9A06;">"gold2"</span>)
par.old <span style="color: #F5666D;">&lt;-</span> par(mar=c(4,4,1.8,1), mgp=c(2.4,.8,0))
plot(fine.hk, lodcolumn=i[2], col=pcolors[2], ylab=<span style="color: #4E9A06;">"LOD"</span>, ylim=c(35,75), bty=<span style="color: #4E9A06;">"l"</span>,
     xlab=<span style="color: #4E9A06;">""</span>, incl.markers=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)
     <span style="color: #204A87;">#</span><span style="color: #204A87;">xlab=paste0("Map position (cM)", paste(rep(" ", 50), collapse="")))</span>
rug(unlist(pull.map(cross.fm), use.names=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>), 0.06, lwd=1.5, quiet=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
plot(fine.hk, lodcolumn=i[1], col=pcolors[1], add=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
add.threshold(fine.hk, perms=fine.perm.hk, alpha=0.05, lodcolumn=i[1], lty=4)
legend(-.1, 70, c(<span style="color: #4E9A06;">"DS1"</span>, <span style="color: #4E9A06;">"DS2"</span>), fill=pcolors, bty=<span style="color: #4E9A06;">"n"</span>)
par(par.old)
dev.off()


<span style="color: #204A87;">## </span><span style="color: #204A87;">2002 individuals, 37 markers</span>
dim(cross.fm$geno[[1]]$data)
<span style="color: #204A87;">## </span><span style="color: #204A87;">Genotypes per marker</span>
apply(cross.fm$geno[[1]]$data, 2, <span style="color: #A52A2A; font-weight: bold;">function</span>(x){ sum(!is.na(x))})
<span style="color: #204A87;">## </span><span style="color: #204A87;">Individuals per family</span>
table(cross.fm$pheno$Family)



<span style="color: #204A87;">## </span><span style="color: #204A87;">Run scantwo on selected phenotypes</span>
np <span style="color: #F5666D;">&lt;-</span> 10000 <span style="color: #204A87;"># </span><span style="color: #204A87;">number of permutations for permutation test</span>
nc <span style="color: #F5666D;">&lt;-</span> 8     <span style="color: #204A87;"># </span><span style="color: #204A87;">number of cores to use (make sure np divisible by nc)</span>
j <span style="color: #F5666D;">&lt;-</span> match(c(<span style="color: #4E9A06;">"Spine_1_rsd1"</span>,<span style="color: #4E9A06;">"Spine_2_rsd1"</span>), names(cross.fm$pheno)[p])
fine2.hk <span style="color: #F5666D;">&lt;-</span> scantwo(cross.fm, pheno.col=p[j], model=<span style="color: #4E9A06;">"normal"</span>, method=<span style="color: #4E9A06;">"hk"</span>)
load(<span style="color: #4E9A06;">"data/fine_mapping.scantwo.permutations.RData"</span>) <span style="color: #204A87;"># </span><span style="color: #204A87;">load precalculated permutations</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Uncomment to re-run permutations</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">fine2.perm.hk &lt;- scantwo(cross.fm, pheno.col=p[j], model="normal", method="hk",</span>
<span style="color: #204A87;">#                       </span><span style="color: #204A87;">n.perm=np, n.cluster=nc)</span>
summary(fine2.perm.hk)
plot(fine2.perm.hk, lodcolumn=1)
plot(fine2.perm.hk, lodcolumn=2)
summary(fine2.hk, perms=fine2.perm.hk, alphas=.05, lodcolumn=1, pvalues=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
summary(fine2.hk, perms=fine2.perm.hk, alphas=.05, lodcolumn=2, pvalues=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>)
<span style="color: #204A87;">## </span><span style="color: #204A87;">For spine 1, an additive model combining mem235 and BRSm018 is supported</span>
find.marker(cross.fm, chr=4, pos=9.3)
find.marker(cross.fm, chr=4, pos=13.2)
pen <span style="color: #F5666D;">&lt;-</span> calc.penalties(fine2.perm.hk, alpha=.05)
pen.avg <span style="color: #F5666D;">&lt;-</span> apply(pen, 2, mean)

<span style="color: #204A87;">## </span><span style="color: #204A87;">Stepwise model selection</span>
<span style="color: #A52A2A; font-weight: bold;">for</span>(i <span style="color: #A52A2A; font-weight: bold;">in</span> 1:length(j)){
    stp.a <span style="color: #F5666D;">&lt;-</span> stepwiseqtl(cross.fm, additive.only=<span style="color: #2F8B58; font-weight: bold;">TRUE</span>, max.qtl=2, method=<span style="color: #4E9A06;">"hk"</span>,
                         pheno.col=p[j[i]], penalties=pen[i,])
    <span style="color: #A52A2A; font-weight: bold;">if</span>(i==1){ stp.fm.1 <span style="color: #F5666D;">&lt;-</span> stp.a }
    <span style="color: #A52A2A; font-weight: bold;">if</span>(i==2){ stp.fm.2 <span style="color: #F5666D;">&lt;-</span> stp.a }
    print(names(cross.fm$pheno)[p[j[i]]])
    print(stp.a)
    print(summary(fitqtl(cross.fm, pheno.col=p[j[i]], qtl=stp.a, method=<span style="color: #4E9A06;">"hk"</span>)))
    <span style="color: #204A87;">#</span><span style="color: #204A87;">stp.i &lt;- stepwiseqtl(cross.fm, max.qtl=2, method="hk",</span>
    <span style="color: #204A87;">#                     </span><span style="color: #204A87;">pheno.col=p[j[i]], penalties=pen[i,])</span>
    <span style="color: #204A87;">#</span><span style="color: #204A87;">print(stp.i)</span>
    <span style="color: #204A87;">#</span><span style="color: #204A87;">print(summary(fitqtl(cross.fm, pheno.col=p[j[i]], qtl=stp.i, method="hk",</span>
    <span style="color: #204A87;">#                     </span><span style="color: #204A87;">formula=attributes(stp.i)$formula)))</span>
}

<span style="color: #204A87;">## </span><span style="color: #204A87;">Again, an additive model combining mem235 and BRSm018 is chosen for spine 1</span>
<span style="color: #204A87;">## </span><span style="color: #204A87;">Results save as data/fine_mapping_stepwise_model_selection_output.txt</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">Phenotype effects</span>
cross.fm <span style="color: #F5666D;">&lt;-</span> sim.geno(cross.fm, n.draws=64)
print(effectplot(cross.fm, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"mem235"</span>))
print(effectplot(cross.fm, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"mem235"</span>))
ptable <span style="color: #F5666D;">&lt;-</span> effectplot(cross.fm, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"mem235"</span>)$Means
ptable <span style="color: #F5666D;">&lt;-</span> as.data.frame(t(ptable))
ptable <span style="color: #F5666D;">&lt;-</span> rbind(ptable, effectplot(cross.fm, pheno.col=p[j[1]], mname1=<span style="color: #4E9A06;">"BRSm018"</span>)$Means)
ptable <span style="color: #F5666D;">&lt;-</span> rbind(ptable, effectplot(cross.fm, pheno.col=p[j[2]], mname1=<span style="color: #4E9A06;">"mem235"</span>)$Means)

qtable1 <span style="color: #F5666D;">&lt;-</span> summary(fitqtl(cross.fm, pheno.col=p[j[1]], qtl=stp.fm.1, method=<span style="color: #4E9A06;">"hk"</span>))$result.drop[,]
qtable2 <span style="color: #F5666D;">&lt;-</span> summary(fitqtl(cross.fm, pheno.col=p[j[2]], qtl=stp.fm.2, method=<span style="color: #4E9A06;">"hk"</span>))$result.full
qtable1 <span style="color: #F5666D;">&lt;-</span> as.data.frame(qtable1)
qtable2 <span style="color: #F5666D;">&lt;-</span> as.data.frame(qtable2)

find.marker(cross.fm, chr=4, pos=13.2)
etable <span style="color: #F5666D;">&lt;-</span> data.frame(Trait=c(<span style="color: #4E9A06;">"DS1"</span>,<span style="color: #4E9A06;">"DS1"</span>,<span style="color: #4E9A06;">"DS2"</span>), Position=c(<span style="color: #4E9A06;">"9.3 cM"</span>,<span style="color: #4E9A06;">"13.2 cM"</span>,<span style="color: #4E9A06;">"9.3 cM"</span>),
                     Marker=c(<span style="color: #4E9A06;">"mem235"</span>,<span style="color: #4E9A06;">"BRSm018"</span>,<span style="color: #4E9A06;">"mem235"</span>), LOD=c(qtable1$LOD,qtable2$LOD[1]),
                     PVE=c(qtable1[,<span style="color: #4E9A06;">"%var"</span>],qtable2[1,<span style="color: #4E9A06;">"%var"</span>]))
ptable <span style="color: #F5666D;">&lt;-</span> cbind(etable, ptable)
print(ptable)

<span style="color: #204A87;">## </span><span style="color: #204A87;">Generate LaTeX table</span>
<span style="color: #F5666D;">library</span>(xtable)
print(xtable(ptable, rownames=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>), include.rownames=<span style="color: #2F8B58; font-weight: bold;">FALSE</span>)


<span style="color: #204A87;">## </span><span style="color: #204A87;">LOD intervals</span>
lodint(stp.fm.1, 4, qtl.index=1, drop=1)
lodint(stp.fm.1, 4, qtl.index=1, drop=.001)
bayesint(stp.fm.1, 4, qtl.index=1, prob=.9)
lodint(stp.fm.1, 4, qtl.index=2, drop=1)
lodint(stp.fm.1, 4, qtl.index=2, drop=.001)
bayesint(stp.fm.1, 4, qtl.index=2, prob=.9)
lodint(stp.fm.2, 4, drop=1)
lodint(stp.fm.2, 4, drop=.001)
bayesint(stp.fm.2, 4, prob=.9)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tim Howes</p>
<p class="date">Created: 2017-07-27 Thu 20:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 9.0.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
